{
    "view_size": [
        3900,
        2700
    ],
    "cps": [
        [
            150,
            90
        ],
        [
            450,
            90
        ],
        [
            750,
            90
        ],
        [
            1050,
            90
        ],
        [
            1350,
            90
        ],
        [
            1650,
            90
        ],
        [
            1950,
            90
        ],
        [
            2250,
            90
        ],
        [
            2550,
            90
        ],
        [
            2850,
            90
        ],
        [
            3150,
            90
        ],
        [
            3450,
            90
        ],
        [
            3750,
            90
        ],
        [
            150,
            270
        ],
        [
            450,
            270
        ],
        [
            750,
            270
        ],
        [
            1050,
            270
        ],
        [
            1350,
            270
        ],
        [
            1650,
            270
        ],
        [
            1950,
            270
        ],
        [
            2250,
            270
        ],
        [
            2550,
            270
        ],
        [
            2850,
            270
        ],
        [
            3150,
            270
        ],
        [
            3450,
            270
        ],
        [
            3750,
            270
        ],
        [
            150,
            450
        ],
        [
            450,
            450
        ],
        [
            750,
            450
        ],
        [
            1050,
            450
        ],
        [
            1350,
            450
        ],
        [
            1650,
            450
        ],
        [
            1950,
            450
        ],
        [
            2250,
            450
        ],
        [
            2550,
            450
        ],
        [
            2850,
            450
        ],
        [
            3150,
            450
        ],
        [
            3450,
            450
        ],
        [
            3750,
            450
        ],
        [
            150,
            630
        ],
        [
            450,
            630
        ],
        [
            750,
            630
        ],
        [
            1050,
            630
        ],
        [
            1350,
            630
        ],
        [
            1650,
            630
        ],
        [
            1950,
            630
        ],
        [
            2250,
            630
        ],
        [
            2550,
            630
        ],
        [
            2850,
            630
        ],
        [
            3150,
            630
        ],
        [
            3450,
            630
        ],
        [
            3750,
            630
        ],
        [
            150,
            810
        ],
        [
            450,
            810
        ],
        [
            750,
            810
        ],
        [
            1050,
            810
        ],
        [
            1350,
            810
        ],
        [
            1650,
            810
        ],
        [
            1950,
            810
        ],
        [
            2250,
            810
        ],
        [
            2550,
            810
        ],
        [
            2850,
            810
        ],
        [
            3150,
            810
        ],
        [
            3450,
            810
        ],
        [
            3750,
            810
        ],
        [
            150,
            990
        ],
        [
            450,
            990
        ],
        [
            750,
            990
        ],
        [
            1050,
            990
        ],
        [
            1350,
            990
        ],
        [
            1650,
            990
        ],
        [
            1950,
            990
        ],
        [
            2250,
            990
        ],
        [
            2550,
            990
        ],
        [
            2850,
            990
        ],
        [
            3150,
            990
        ],
        [
            3450,
            990
        ],
        [
            3750,
            990
        ],
        [
            150,
            1170
        ],
        [
            450,
            1170
        ],
        [
            750,
            1170
        ],
        [
            1050,
            1170
        ],
        [
            1350,
            1170
        ],
        [
            1650,
            1170
        ],
        [
            1950,
            1170
        ],
        [
            2250,
            1170
        ],
        [
            2550,
            1170
        ],
        [
            2850,
            1170
        ],
        [
            3150,
            1170
        ],
        [
            3450,
            1170
        ],
        [
            3750,
            1170
        ],
        [
            150,
            1350
        ],
        [
            450,
            1350
        ],
        [
            750,
            1350
        ],
        [
            1050,
            1350
        ],
        [
            1350,
            1350
        ],
        [
            1650,
            1350
        ],
        [
            1950,
            1350
        ],
        [
            2250,
            1350
        ],
        [
            2550,
            1350
        ],
        [
            2850,
            1350
        ],
        [
            3150,
            1350
        ],
        [
            3450,
            1350
        ],
        [
            3750,
            1350
        ],
        [
            150,
            1530
        ],
        [
            450,
            1530
        ],
        [
            750,
            1530
        ],
        [
            1050,
            1530
        ],
        [
            1350,
            1530
        ],
        [
            1650,
            1530
        ],
        [
            1950,
            1530
        ],
        [
            2250,
            1530
        ],
        [
            2550,
            1530
        ],
        [
            2850,
            1530
        ],
        [
            3150,
            1530
        ],
        [
            3450,
            1530
        ],
        [
            3750,
            1530
        ],
        [
            150,
            1710
        ],
        [
            450,
            1710
        ],
        [
            750,
            1710
        ],
        [
            1050,
            1710
        ],
        [
            1350,
            1710
        ],
        [
            1650,
            1710
        ],
        [
            1950,
            1710
        ],
        [
            2250,
            1710
        ],
        [
            2550,
            1710
        ],
        [
            2850,
            1710
        ],
        [
            3150,
            1710
        ],
        [
            3450,
            1710
        ],
        [
            3750,
            1710
        ],
        [
            150,
            1890
        ],
        [
            450,
            1890
        ],
        [
            750,
            1890
        ],
        [
            1050,
            1890
        ],
        [
            1350,
            1890
        ],
        [
            1650,
            1890
        ],
        [
            1950,
            1890
        ],
        [
            2250,
            1890
        ],
        [
            2550,
            1890
        ],
        [
            2850,
            1890
        ],
        [
            3150,
            1890
        ],
        [
            3450,
            1890
        ],
        [
            3750,
            1890
        ],
        [
            150,
            2070
        ],
        [
            450,
            2070
        ],
        [
            750,
            2070
        ],
        [
            1050,
            2070
        ],
        [
            1350,
            2070
        ],
        [
            1650,
            2070
        ],
        [
            1950,
            2070
        ],
        [
            2250,
            2070
        ],
        [
            2550,
            2070
        ],
        [
            2850,
            2070
        ],
        [
            3150,
            2070
        ],
        [
            3450,
            2070
        ],
        [
            3750,
            2070
        ],
        [
            150,
            2250
        ],
        [
            450,
            2250
        ],
        [
            750,
            2250
        ],
        [
            1050,
            2250
        ],
        [
            1350,
            2250
        ],
        [
            1650,
            2250
        ],
        [
            1950,
            2250
        ],
        [
            2250,
            2250
        ],
        [
            2550,
            2250
        ],
        [
            2850,
            2250
        ],
        [
            3150,
            2250
        ],
        [
            3450,
            2250
        ],
        [
            3750,
            2250
        ],
        [
            150,
            2430
        ],
        [
            450,
            2430
        ],
        [
            750,
            2430
        ],
        [
            1050,
            2430
        ],
        [
            1350,
            2430
        ],
        [
            1650,
            2430
        ],
        [
            1950,
            2430
        ],
        [
            2250,
            2430
        ],
        [
            2550,
            2430
        ],
        [
            2850,
            2430
        ],
        [
            3150,
            2430
        ],
        [
            3450,
            2430
        ],
        [
            3750,
            2430
        ],
        [
            150,
            2610
        ],
        [
            450,
            2610
        ],
        [
            750,
            2610
        ],
        [
            1050,
            2610
        ],
        [
            1350,
            2610
        ],
        [
            1650,
            2610
        ],
        [
            1950,
            2610
        ],
        [
            2250,
            2610
        ],
        [
            2550,
            2610
        ],
        [
            2850,
            2610
        ],
        [
            3150,
            2610
        ],
        [
            3450,
            2610
        ],
        [
            3750,
            2610
        ]
    ],
    "crsList": [
        {
            "key": "189",
            "ref": null,
            "props": {
                "keyFromParent": 189,
                "crs_id": "05317",
                "name": "Design of Artificial Intelligence Products",
                "description": "This course teaches students how to design new products and services that leverage the capabilities of AI and machine learning to improve the quality of peoples lives. Students will learn to follow a matchmaking design, user-centered design, and service design process. Students will learn to ideate; reframing problematic situations by envisioning many possible products and services. Students will learn to iteratively refine and assess their ideas with real users/customers. Class projects will focus on the challenges of deploying systems that generate errors and the challenges of situating intelligent systems such that they harmonize the best qualities of human and machine intelligence.",
                "prerequisites": [],
                "cp": [
                    2250,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "53",
            "ref": null,
            "props": {
                "keyFromParent": 53,
                "crs_id": "05391",
                "name": "Designing Human Centered Software:",
                "description": "Why are things so hard to use these days? Why doesnt this thing I just bought work? Why is this web site so hard to use? These are frustrations that we have all faced from systems not designed with people in mind. The question this course will focus on is: how can we design human-centered systems that people find useful and usable? This course is an introduction to designing, prototyping, and evaluating user interfaces. If you take only one course in Human-Computer Interaction, this is the course for you. This class is open to all undergrads and grad students, with either technical or non-technical backgrounds. We will cover theory as well as practical application of ideas from Human-Computer Interaction. Course work includes lectures, class discussion, homework, class presentations, and group project.",
                "prerequisites": [
                    "15112",
                    "15110",
                    "15104",
                    "15122"
                ],
                "cp": [
                    450,
                    810
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "96",
            "ref": null,
            "props": {
                "keyFromParent": 96,
                "crs_id": "07180",
                "name": "Concepts in Artificial Intelligence",
                "description": "Students who wish to apply for acceptance into the AI major are expected to take this course during their first year. The course will introduce students to the main foundational concepts and techniques used in Artificial Intelligence, including decision making, planning, machine learning, and perception, and will present a range of real-world applications in which AI is currently used. Students will be introduced to the history of AI, as well as the potential future of a world in which AI is commonplace. Students will engage in hands-on exercises to get a feel for AI techniques.",
                "prerequisites": [
                    "15112",
                    "15122"
                ],
                "cp": [
                    1650,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "97",
            "ref": null,
            "props": {
                "keyFromParent": 97,
                "crs_id": "10315",
                "name": "Introduction to Machine Learning",
                "description": "Machine learning is subfield of computer science with the goal of exploring, studying, and developing learning systems, methods, and algorithms that can improve their performance with learning from data. This course is designed to give undergraduate students a one-semester-long introduction to the main principles, algorithms, and applications of machine learning and is specifically designed for the SCS undergrad majors. The topics of this course will be in part parallel with those covered in the graduate machine learning courses (10-715, 10-701, 10-601), but with a greater emphasis on applications and case studies in machine learning. After completing the course, students will be able to: *select and apply an appropriate supervised learning algorithm for classification problems (e.g., naive Bayes, perceptron, support vector machine, logistic regression). *select and apply an appropriate supervised learning algorithm for regression problems (e.g., linear regression, ridge regression). *recognize different types of unsupervised learning problems, and select and apply appropriate algorithms (e.g., clustering, linear and nonlinear dimensionality reduction). *work with probabilities (Bayes rule, conditioning, expectations, independence), linear algebra (vector and matrix operations, eigenvectors, SVD), and calculus (gradients, Jacobians) to derive machine learning methods such as linear regression, naive Bayes, and principal components analysis. *understand machine learning principles such as model selection, overfitting, and underfitting, and techniques such as cross-validation and regularization. *implement machine learning algorithms such as logistic regression via stochastic gradient descent, linear regression (using a linear algebra toolbox), perceptron, or k-means clustering. *run appropriate supervised and unsupervised learning algorithms on real and synthetic data sets and interpret the results.",
                "prerequisites": [
                    "15122",
                    "21127",
                    "21128",
                    "15151",
                    "21325",
                    "36217",
                    "36218",
                    "36225",
                    "15359"
                ],
                "cp": [
                    1950,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "176",
            "ref": null,
            "props": {
                "keyFromParent": 176,
                "crs_id": "10403",
                "name": "Deep Reinforcement Learning & Control",
                "description": "This course will cover latest advances in Reinforcement Learning and Imitation learning. This is a fast developing research field and an official textbook is available only for about one forth of the course material. The rest will be taught from recent research papers. This course brings together many disciplines of Artificial Intelligence to show how to develop intelligent agent that can learn to sense the world and learn to act imitating others or maximizing sparse rewards Particular focus will be given in incorporating visual sensory input and learning suitable visual state representations.",
                "prerequisites": [
                    "10301",
                    "10315",
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    2250,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "178",
            "ref": null,
            "props": {
                "keyFromParent": 178,
                "crs_id": "10417",
                "name": "Intermediate Deep Learning",
                "description": "Building intelligent machines that are capable of extracting meaningful representations from data lies at the core of solving many AI related tasks. In the past decade, researchers across many communities, from applied statistics to engineering, computer science and neuroscience, have developed deep models that are composed of several layers of nonlinear processing. An important property of these models is that they can learn useful representations by re-using and combining intermediate concepts, allowing these models to be successfully applied in a wide variety of domains, including visual object recognition, information retrieval, natural language processing, and speech perception. The goal of this course is to introduce students to both the foundational ideas and the recent advances in deep learning. The first part of the course will focus on supervised learning, including neural networks, back-propagation algorithm, convolutional models, recurrent neural networks, and their extensions with applications to image recognition, video analysis, and language modelling. The second part of the course will cover unsupervised learning, including variational autoencoders, sparse-coding, Boltzmann machines, and generative adversarial networks. This course will assume a reasonable degree of mathematical maturity and will require strong programming skills.",
                "prerequisites": [
                    "10301",
                    "10315",
                    "10715",
                    "10601",
                    "10701"
                ],
                "cp": [
                    2850,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "152",
            "ref": null,
            "props": {
                "keyFromParent": 152,
                "crs_id": "10418",
                "name": "Machine Learning for Structured Data",
                "description": "A key challenge in machine learning is that of structured prediction: taking unstructured data as input and producing a structured output. Structured prediction problems abound throughout application areas such as natural language processing, speech processing, computational biology, computer vision, healthcare, and many others. In this course, we will study modern approaches to structured prediction building on probabilistic graphical models, deep learning, and search. The course will focus on three key aspects: models, inference, and learning. The models we consider will focus on both generative and discriminative models such as Bayesian networks, Markov random fields (MRFs), conditional random fields (CRFs), and deep neural networks including convolutional neural networks (CNNs) and recurrent neural networks (RNNs) -- as well as hybrids of graphical models and neural networks. The course will explore approaches to exact and approximate inference: junction tree algorithm, approximate marginal inference by Markov chain Monte Carlo (MCMC) and variational methods, approximate MAP inference by integer linear programming (ILP) and search. We will explore unsupervised, semi-supervised, and supervised learning using different formulations of the learning problem: MLE, Bayesian inference, structured perceptron, M3Ns, learning to search, and autoencoders. Covered applications will include machine translation, speech recognition, DNA sequence analysis, scene understanding, medical diagnosis. This course is cross-listed as 10-418 and 10-618; students registered for 10-618 will do a course project.",
                "prerequisites": [
                    "10301",
                    "10315",
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    2850,
                    2070
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "159",
            "ref": null,
            "props": {
                "keyFromParent": 159,
                "crs_id": "10605",
                "name": "Machine Learning with Large Datasets",
                "description": "Large datasets are difficult to work with for several reasons. They are difficult to visualize, and it is difficult to understand what sort of errors and biases are present in them. They are computationally expensive to process, and often the cost of learning is hard to predict - for instance, and algorithm that runs quickly in a dataset that fits in memory may be exorbitantly expensive when the dataset is too large for memory. Large datasets may also display qualitatively different behavior in terms of which learning methods produce the most accurate predictions. This course is intended to provide a student practical knowledge of, and experience with, the issues involving large datasets. Among the issues considered are: scalable learning techniques, such as streaming machine learning techniques; parallel infrastructures such as map-reduce; practical techniques for reducing the memory requirements for learning methods, such as feature hashing and Bloom filters; and techniques for analysis of programs in terms of memory, disk usage, and (for parallel methods) communication complexity. The class will include programming assignments, and a one-month short project chosen by the student. The project will be designed to compare the scalability of variant learning algorithms on datasets. An introductory course in machine learning, like 10-601 or 10-701, is a prerequisite or a co-requisite. If you plan to take this course and 10-601 concurrently please tell the instructor. The course will include several substantial programming assignments, so an additional prerequisite is 15-211, or 15-214, or comparable familiarity with Java and good programming skills.",
                "prerequisites": [
                    "15214",
                    "15210",
                    "17214",
                    "10315",
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    1050,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "165",
            "ref": null,
            "props": {
                "keyFromParent": 165,
                "crs_id": "10703",
                "name": "Deep Reinforcement Learning",
                "description": "This course will cover latest advances in Reinforcement Learning and Imitation learning. This is a fast developing research field and an official textbook is available only for about one forth of the course material. The rest will be taught from recent research papers. This course brings together many disciplines of Artificial Intelligence to show how to develop intelligent agent that can learn to sense the world and learn to act imitating others or maximizing sparse rewards Particular focus will be given in incorporating visual sensory input and learning suitable visual state representations.",
                "prerequisites": [
                    "10301",
                    "10315",
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    2850,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "161",
            "ref": null,
            "props": {
                "keyFromParent": 161,
                "crs_id": "10707",
                "name": "Topics in Deep Learning",
                "description": "Building intelligent machines that are capable of extracting meaningful representations from high-dimensional data lies at the core of solving many AI related tasks. In the past few years, researchers across many different communities, from applied statistics to engineering, computer science and neuroscience, have developed deep (hierarchical) models -- models that are composed of several layers of nonlinear processing. An important property of these models is that they can learn useful representations by re-using and combining intermediate concepts, allowing these models to be successfully applied in a wide variety of domains, including visual object recognition, information retrieval, natural language processing, and speech perception. This is an advanced graduate course, designed for Masters and Ph.D. level students, and will assume a reasonable degree of mathematical maturity. The goal of this course is to introduce students to the recent and exciting developments of various deep learning methods. Some topics to be covered include: restricted Boltzmann machines (RBMs) and their multi-layer extensions Deep Belief Networks and Deep Boltzmann machines; sparse coding, autoencoders, variational autoencoders, convolutional neural networks, recurrent neural networks, generative adversarial networks, and attention-based models with applications in vision, NLP, and multimodal learning. We will also address mathematical issues, focusing on efficient large-scale optimization methods for inference and learning, as well as training density models with intractable partition functions. Prerequisite: ML: 10-701 or 10-715, and strong programming skills.",
                "prerequisites": [
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    1650,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "160",
            "ref": null,
            "props": {
                "keyFromParent": 160,
                "crs_id": "10708",
                "name": "Probabilistic Graphical Models",
                "description": "Many of the problems in artificial intelligence, statistics, computer systems, computer vision, natural language processing, and computational biology, among many other fields, can be viewed as the search for a coherent global conclusion from local information. The probabilistic graphical models framework provides an unified view for this wide range of problems, enabling efficient inference, decision-making and learning in problems with a very large number of attributes and huge datasets. This graduate-level course will provide you with a strong foundation for both applying graphical models to complex problems and for addressing core research topics in graphical models. The class will cover three aspects: The core representation, including Bayesian and Markov networks, and dynamic Bayesian networks; probabilistic inference algorithms, both exact and approximate; and, learning methods for both the parameters and the structure of graphical models. Students entering the class should have a pre-existing working knowledge of probability, statistics, and algorithms, though the class has been designed to allow students with a strong numerate background to catch up and fully participate. It is expected that after taking this class, the students should have obtain sufficient working knowledge of multi-variate probabilistic modeling and inference for practical applications, should be able to formulate and solve a wide range of problems in their own domain using GM, and can advance into more specialized technical literature by themselves. Students are required to have successfully completed 10701 or 10715, or an equivalent class.",
                "prerequisites": [
                    "10715",
                    "10701"
                ],
                "cp": [
                    1350,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "136",
            "ref": null,
            "props": {
                "keyFromParent": 136,
                "crs_id": "10715",
                "name": "Advanced Introduction to Machine Learning",
                "description": "The rapid improvement of sensory techniques and processor speed, and the availability of inexpensive massive digital storage, have led to a growing demand for systems that can automatically comprehend and mine massive and complex data from diverse sources. Machine Learning is becoming the primary mechanism by which information is extracted from Big Data, and a primary pillar that Artificial Intelligence is built upon. This course is designed for Ph.D. students whose primary field of study is machine learning, and who intend to make machine learning methodological research a main focus of their thesis. It will give students a thorough grounding in the algorithms, mathematics, theories, and insights needed to do in-depth research and applications in machine learning. The topics of this course will in part parallel those covered in the general PhD-level machine learning course (10-701), but with a greater emphasis on depth in theory and algorithms. The course will also include additional advanced topics such as fairness in machine learning. Students entering the class are expected to have a pre-existing strong working knowledge of algorithms, linear algebra, probability, and statistics. If you are interested in this topic, but do not have the required background or are not planning to work on a PhD thesis with machine learning as the main focus, you might consider the general PhD-level Machine Learning course (10-701) or the Masters-level Machine Learning course (10-601). ML course comparison: https://goo.gl/mmR2eL",
                "prerequisites": [
                    "15122",
                    "21128",
                    "21127",
                    "15151",
                    "15259",
                    "15359",
                    "36225",
                    "36217",
                    "21325",
                    "36218"
                ],
                "cp": [
                    1950,
                    1890
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "175",
            "ref": null,
            "props": {
                "keyFromParent": 175,
                "crs_id": "10716",
                "name": "Advanced Machine Learning: Theory and Methods",
                "description": "Advanced Machine Learning: Theory and Methods is a graduate level course introducing the theoretical foundations of modern machine learning, as well as advanced methods and frameworks used in modern machine learning. The course assumes that students have taken graduate level introductory courses in machine learning (Introduction to Machine Learning, 10-701 or 10-715), as well as Statistics (Intermediate Statistics, 36-700 or 36-705). The course treats both the art of designing good learning algorithms, as well as the science of analyzing an algorithms computational and statistical properties and performance guarantees. Theorems are presented together with practical aspects of methodology and intuition to help students develop tools for selecting appropriate methods and approaches to problems in their own research. We will cover theoretical foundation topics such as computational and statistical convergence rates, minimax estimation, and concentration of measure. We will also cover advanced machine learning methods such as nonparametric density estimation, nonparametric regression, and Bayesian estimation, as well as advanced frameworks such as privacy, causality, and stochastic learning algorithms.",
                "prerequisites": [
                    "10701",
                    "10715",
                    "36700",
                    "36705"
                ],
                "cp": [
                    1950,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "139",
            "ref": null,
            "props": {
                "keyFromParent": 139,
                "crs_id": "10718",
                "name": "Data Analysis",
                "description": "In this course students will gain exposure to practical aspects of machine learning and data analysis. Through a mix of lectures, student presentations, and assignments, the course will cover the various stages in modern data analysis pipelines, as well other relevant applied learning topics, including experimental design for properly evaluating statistical methods, modern societal problems related to FATE (fairness, accountability, transparency, ethics), and ML engineering best-practices.",
                "prerequisites": [],
                "cp": [
                    2850,
                    1890
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "191",
            "ref": null,
            "props": {
                "keyFromParent": 191,
                "crs_id": "10725",
                "name": "Convex Optimization",
                "description": "Nearly every problem in machine learning can be formulated as the optimization of some function, possibly under some set of constraints. This universal reduction may seem to suggest that such optimization tasks are intractable. Fortunately, many real world problems have special structure, such as convexity, smoothness, separability, etc., which allow us to formulate optimization problems that can often be solved efficiently. This course is designed to give a graduate-level student a thorough grounding in the formulation of optimization problems that exploit such structure, and in efficient solution methods for these problems. The main focus is on the formulation and solution of convex optimization problems, though we will discuss some recent advances in nonconvex optimization. These general concepts will also be illustrated through applications in machine learning and statistics. Students entering the class should have a pre-existing working knowledge of algorithms, though the class has been designed to allow students with a strong numerate background to catch up and fully participate. Though not required, having taken 10-701 or an equivalent machine learning or statistical modeling class is strongly encouraged, as we will use applications in machine learning and statistics to demonstrate the concepts we cover in class. Students will work on an extensive optimization-based project throughout the semester.",
                "prerequisites": [],
                "cp": [
                    2850,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "135",
            "ref": null,
            "props": {
                "keyFromParent": 135,
                "crs_id": "10745",
                "name": "Scalability in Machine Learning",
                "description": "The goal of this course is to provide a survey into some of the recent advances in the theory and practice of dealing with scalability issues in machine learning. We will investigate scalability issues along the following dimensions: Challenges with i) large datasets, ii) high-dimensions, and iii) complex data structure. The course is intended to prepare students to write research papers about scalability issues in machine learning. This is an advanced-level, fast-paced course that requires students to already have a solid understanding of machine learning (e.g. by taking an intro to ML class), good programming skills in Python, and being comfortable with dealing with abstract mathematical concepts and reading research papers. The course will have significant overlap with 10-405/605/805, but 10-745 will be faster-paced and go deeper into the theoretical investigations of the methods. Some of the classes will be flipped that will require students to watch a video lecture or read a research paper before the class, and the content will be discussed during the class time. The class will include a course project, HW assignments, and two-in class exams.",
                "prerequisites": [
                    "10301",
                    "10315",
                    "10401",
                    "10601",
                    "10701",
                    "10715"
                ],
                "cp": [
                    1650,
                    1890
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "14",
            "ref": null,
            "props": {
                "keyFromParent": 14,
                "crs_id": "11411",
                "name": "Natural Language Processing:",
                "description": "This course is about a variety of ways to represent human languages (like English and Chinese) as computational systems, and how to exploit those representations to write programs that do neat stuff with text and speech data, like translation, summarization, extracting information, question answering, natural interfaces to databases, and conversational agents. This field is called Natural Language Processing or Computational Linguistics, and it is extremely multidisciplinary. This course will therefore include some ideas central to Machine Learning and to Linguistics. Well cover computational treatments of words, sounds, sentences, meanings, and conversations. Well see how probabilities and real-world text data can help. Well see how different levels interact in state-of-the-art approaches to applications like translation and information extraction. From a software engineering perspective, there will be an emphasis on rapid prototyping, a useful skill in many other areas of Computer Science.",
                "prerequisites": [
                    "15122"
                ],
                "cp": [
                    450,
                    270
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "27",
            "ref": null,
            "props": {
                "keyFromParent": 27,
                "crs_id": "11441",
                "name": "Machine Learning for Text Mining",
                "description": "This course provides a comprehensive introduction to the theory and implementation of algorithms for organizing and searching large text collections. The first half of the course studies text search engines for enterprise and Web environments; the open-source Indri search engine is used as a working example. The second half studies text mining techniques such as clustering, categorization, and information extraction. Programming assignments give hands-on experience with document ranking algorithms, categorizing documents into browsing hierarchies, and related topics.",
                "prerequisites": [],
                "cp": [
                    450,
                    450
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "26",
            "ref": null,
            "props": {
                "keyFromParent": 26,
                "crs_id": "11442",
                "name": "Search Engines",
                "description": "This course studies the theory, design, and implementation of text-based search engines. The core components include statistical characteristics of text, representation of information needs and documents, several important retrieval models, and experimental evaluation. The course also covers common elements of commercial search engines, for example, integration of diverse search engines into a single search service (federated search, vertical search), personalized search results, diverse search results, and sponsored search. The software architecture components include design and implementation of large-scale, distributed search engines.",
                "prerequisites": [],
                "cp": [
                    150,
                    450
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "179",
            "ref": null,
            "props": {
                "keyFromParent": "179",
                "crs_id": "11485",
                "name": "Introduction to Deep Learning",
                "description": "Neural networks have increasingly taken over various AI tasks, and currently produce the state of the art in many AI tasks ranging from computer vision and planning for self-driving cars to playing computer games. Basic knowledge of NNs, known currently in the popular literature as deep learning, familiarity with various formalisms, and knowledge of tools, is now an essential requirement for any researcher or developer in most AI and NLP fields. This course is a broad introduction to the field of neural networks and their deep learning formalisms. The course traces some of the development of neural network theory and design through time, leading quickly to a discussion of various network formalisms, including simple feedforward, convolutional, recurrent, and probabilistic formalisms, the rationale behind their development, and challenges behind learning such networks and various proposed solutions. We subsequently cover various extensions and models that enable their application to various tasks such as computer vision, speech recognition, machine translation and playing games. Instruction Unlike prior editions of 11-785, the instruction will primarily be through instructor lectures, and the occasional guest lecture. Evaluation Students will be evaluated based on weekly continuous-evaluation tests, and their performance in assignments and a final course project. There will be six hands-on assignments, requiring both low-level coding and toolkit-based implementation of neural networks, covering basic MLP, convolutional and recurrent formalisms, as well as one or more advanced tasks, in addition to the final project.",
                "prerequisites": [
                    "15112",
                    "21120",
                    "21241"
                ],
                "cp": [
                    3150,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "0",
            "ref": null,
            "props": {
                "keyFromParent": 0,
                "crs_id": "11492",
                "name": "Speech Processing",
                "description": "Speech Processing offers a practical and theoretical understanding of how human speech can be processed by computers. It covers speech recognition, speech synthesis and spoken dialog systems. The course involves practicals where the student will build working speech recognition systems, build their own synthetic voice and build a complete telephone spoken dialog system. This work will be based on existing toolkits. Details of algorithms, techniques and limitations of state of the art speech systems will also be presented. This course is designed for students wishing understand how to process real data for real applications, applying statistical and machine learning techniques as well as working with limitations in the technology.",
                "prerequisites": [
                    "15211"
                ],
                "cp": [
                    150,
                    90
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "45",
            "ref": null,
            "props": {
                "keyFromParent": 45,
                "crs_id": "15122",
                "name": "Principles of Imperative Computation",
                "description": "For students with a basic understanding of programming (variables, expressions, loops, arrays, functions). Teaches imperative programming and methods for ensuring the correctness of programs. Students will learn the process and concepts needed to go from high-level descriptions of algorithms to correct imperative implementations, with specific application to basic data structures and algorithms. Much of the course will be conducted in a subset of C amenable to verification, with a transition to full C near the end. This course prepares students for 15-213 and 15-210. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.",
                "prerequisites": [
                    "15112",
                    "21127",
                    "15151"
                ],
                "cp": [
                    1950,
                    630
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "4",
            "ref": null,
            "props": {
                "keyFromParent": 4,
                "crs_id": "15128",
                "name": "Freshman Immigration Course",
                "description": "The Freshman Immigration Course is taken by first-semester Computer Science majors on the Pittsburgh campus. The course is designed to acquaint incoming majors with computer science at CMU. Talks range from historical perspectives in the field to descriptions of the cutting edge research being conducted in the School of Computer Science. Enrollment is limited to SCS Freshmen ONLY.",
                "prerequisites": [],
                "cp": [
                    1350,
                    90
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "67",
            "ref": null,
            "props": {
                "keyFromParent": 67,
                "crs_id": "15150",
                "name": "Principles of Functional Programming",
                "description": "An introduction to programming based on a functional model of computation. The functional model is a natural generalization of algebra in which programs are formulas that describe the output of a computation in terms of its inputs---that is, as a function. But instead of being confined to real- or complex-valued functions, the functional model extends the algebraic view to a very rich class of data types, including not only aggregates built up from other types, but also functions themselves as values. This course is an introduction to programming that is focused on the central concepts of function and type. One major theme is the interplay between inductive types, which are built up incrementally; recursive functions, which compute over inductive types by decomposition; and proof by structural induction, which is used to prove the correctness and time complexity of a recursive function. Another major theme is the role of types in structuring large programs into separate modules, and the integration of imperative programming through the introduction of data types whose values may be altered during computation. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.",
                "prerequisites": [
                    "15151",
                    "21127",
                    "21128",
                    "15112"
                ],
                "cp": [
                    750,
                    990
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "18",
            "ref": null,
            "props": {
                "keyFromParent": 18,
                "crs_id": "15151",
                "name": "Mathematical Foundations for Computer Science",
                "description": "*CS majors only* This course is offered to incoming Computer Science freshmen and focuses on the fundamental concepts in Mathematics that are of particular interest to Computer Science such as logic, sets,induction, functions, and combinatorics. These topics are used as a context in which students learn to formalize arguments using the methods of mathematical proof. This course uses experimentation and collaboration as ways to gain better understanding of the material. Open to CS freshmen only. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.",
                "prerequisites": [],
                "cp": [
                    1650,
                    270
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "93",
            "ref": null,
            "props": {
                "keyFromParent": 93,
                "crs_id": "15210",
                "name": "Parallel and Sequential Data Structures and Algorithms",
                "description": "Teaches students about how to design, analyze, and program algorithms and data structures. The course emphasizes parallel algorithms and analysis, and how sequential algorithms can be considered a special case. The course goes into more theoretical content on algorithm analysis than 15-122 and 15-150 while still including a significant programming component and covering a variety of practical applications such as problems in data analysis, graphics, text processing, and the computational sciences. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.",
                "prerequisites": [
                    "15122",
                    "15150"
                ],
                "cp": [
                    750,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "22",
            "ref": null,
            "props": {
                "keyFromParent": 22,
                "crs_id": "15213",
                "name": "Introduction to Computer Systems",
                "description": "This course provides a programmers view of how computer systems execute programs, store information, and communicate. It enables students to become more effective programmers, especially in dealing with issues of performance, portability and robustness. It also serves as a foundation for courses on compilers, networks, operating systems, and computer architecture, where a deeper understanding of systems-level issues is required. Topics covered include: machine-level code and its generation by optimizing compilers, performance evaluation and optimization, computer arithmetic, memory organization and management, networking technology and protocols, and supporting concurrent computation. NOTE FOR GRADUATE STUDENTS: This course is not open to graduate students beginning Spring 2015. Graduate students must register for 15-513 instead.",
                "prerequisites": [
                    "15122"
                ],
                "cp": [
                    2850,
                    270
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "94",
            "ref": null,
            "props": {
                "keyFromParent": 94,
                "crs_id": "15251",
                "name": "Great Ideas in Theoretical Computer Science",
                "description": "This course is about how to use theoretical ideas to formulate and solve problems in computer science. It integrates mathematical material with general problem solving techniques and computer science applications. Examples are drawn from algorithms, complexity theory, game theory, probability theory, graph theory, automata theory, algebra, cryptography, and combinatorics. Assignments involve both mathematical proofs and programming. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.",
                "prerequisites": [
                    "15122",
                    "15150",
                    "21127",
                    "21128",
                    "15151"
                ],
                "cp": [
                    1050,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "85",
            "ref": null,
            "props": {
                "keyFromParent": 85,
                "crs_id": "15259",
                "name": "Probability and Computing",
                "description": "Probability theory is indispensable in computer science today. In areas such as artificial intelligence and computer science theory, probabilistic reasoning and randomization are central. Within networks and systems, probability is used to model uncertainty and queuing latency. This course gives an introduction to probability as it is used in computer science theory and practice, drawing on applications and current research developments as motivation. The course has 3 parts: Part I is an introduction to probability, including discrete and continuous random variables, heavy tails, simulation, Laplace transforms, z-transforms, and applications of generating functions. Part II is an in-depth coverage of concentration inequalities, like the Chernoff bound and SLLN bounds, as well as their use in randomized algorithms. Part III covers Markov chains (both discrete-time and continuous-time) and stochastic processes and their application to queuing systems performance modeling. This is a fast-paced class which will cover more material than the other probability options and will cover it in greater depth.",
                "prerequisites": [
                    "15251",
                    "21259",
                    "21241"
                ],
                "cp": [
                    2250,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "87",
            "ref": null,
            "props": {
                "keyFromParent": 87,
                "crs_id": "15281",
                "name": "Artificial Intelligence: Representation and Problem Solving",
                "description": "This course is about the theory and practice of Artificial Intelligence. We will study modern techniques for computers to represent task-relevant information and make intelligent (i.e. satisficing or optimal) decisions towards the achievement of goals. The search and problem solving methods are applicable throughout a large range of industrial, civil, medical, financial, robotic, and information systems. We will investigate questions about AI systems such as: how to represent knowledge, how to effectively generate appropriate sequences of actions and how to search among alternatives to find optimal or near-optimal solutions. We will also explore how to deal with uncertainty in the world, how to learn from experience, and how to learn decision rules from data. We expect that by the end of the course students will have a thorough understanding of the algorithmic foundations of AI, how probability and AI are closely interrelated, and how automated agents learn. We also expect students to acquire a strong appreciation of the big-picture aspects of developing fully autonomous intelligent agents. Other lectures will introduce additional aspects of AI, including natural language processing, web-based search engines, industrial applications, autonomous robotics, and economic/game-theoretic decision making.",
                "prerequisites": [
                    "15122",
                    "21241",
                    "15151",
                    "21127",
                    "21128",
                    "21122"
                ],
                "cp": [
                    2850,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "77",
            "ref": null,
            "props": {
                "keyFromParent": 77,
                "crs_id": "15386",
                "name": "Neural Computation",
                "description": "Computational neuroscience is an interdisciplinary science that seeks to understand how the brain computes to achieve natural intelligence. It seeks to understand the computational principles and mechanisms of intelligent behaviors and mental abilities -- such as perception, language, motor control, and learning -- by building artificial systems and computational models with the same capabilities. This course explores how neurons encode and process information, adapt and learn, communicate, cooperate, compete and compute at the individual level as well as at the levels of networks and systems. It will introduce basic concepts in computational modeling, information theory, signal processing, system analysis, statistical and probabilistic inference. Concrete examples will be drawn from the visual system and the motor systems, and studied from computational, psychological and biological perspectives. Students will learn to perform computational experiments using Matlab and quantitative studies of neurons and neuronal networks.",
                "prerequisites": [
                    "15112",
                    "15122",
                    "21122"
                ],
                "cp": [
                    3750,
                    990
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "90",
            "ref": null,
            "props": {
                "keyFromParent": 90,
                "crs_id": "15387",
                "name": "Computational Perception",
                "description": "In this course, we will first cover the biological and psychological foundational knowledge of biological perceptual systems, and then apply computational thinking to investigate the principles and mechanisms underlying natural perception. The course will focus on vision this year, but will also touch upon other sensory modalities. You will learn how to reason scientifically and computationally about problems and issues in perception, how to extract the essential computational properties of those abstract ideas, and finally how to convert these into explicit mathematical models and computational algorithms. Topics include perceptual representation and inference, perceptual organization, perceptual constancy, object recognition, learning and scene analysis. Prerequisites: First year college calculus, some basic knowledge of linear algebra and probability and some programming experience are desirable.",
                "prerequisites": [
                    "21122",
                    "21241",
                    "15112"
                ],
                "cp": [
                    3750,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "37",
            "ref": null,
            "props": {
                "keyFromParent": 37,
                "crs_id": "15463",
                "name": "Computational Photography",
                "description": "Computational photography is the convergence of computer graphics, computer vision and imaging. Its role is to overcome the limitations of the traditional camera, by combining imaging and computation to enable new and enhanced ways of capturing, representing, and interacting with the physical world. This advanced undergraduate course provides a comprehensive overview of the state of the art in computational photography. At the start of the course, we will study modern image processing pipelines, including those encountered on mobile phone and DSLR cameras, and advanced image and video editing algorithms. Then we will proceed to learn about the physical and computational aspects of tasks such as 3D scanning, coded photography, lightfield imaging, time-of-flight imaging, VR/AR displays, and computational light transport. Near the end of the course, we will discuss active research topics, such as creating cameras that capture video at the speed of light, cameras that look around walls, or cameras that can see through tissue. The course has a strong hands-on component, in the form of seven homework assignments and a final project. In the homework assignments, students will have the opportunity to implement many of the techniques covered in the class, by both acquiring their own images of indoor and outdoor scenes and developing the computational tools needed to extract information from them. For their final projects, students will have the choice to use modern sensors provided by the instructors (lightfield cameras, time-of-flight cameras, depth sensors, structured light systems, etc.). This course requires familarity with linear algebra, calculus, programming, and doing computations with images. The course does not require prior experience with photography or imaging.",
                "prerequisites": [
                    "15213",
                    "21241",
                    "18202",
                    "15462",
                    "16385",
                    "16720",
                    "18793"
                ],
                "cp": [
                    3450,
                    450
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "112",
            "ref": null,
            "props": {
                "keyFromParent": 112,
                "crs_id": "15482",
                "name": "Autonomous Agents",
                "description": "Autonomous agents use perception, cognition, actuation, and learning to reliably achieve desired goals, where the agents can be smart homes, mobile robots, intelligent factories, self-driving cars, etc. The goal of this course is to provide students with the techniques needed for developing complete, integrated AI-based autonomous agents. Topics to be investigated include architectures for intelligent agents, task planning, reasoning under uncertainty, optimization, monitoring, execution, error detection and recovery, collaborative and adversarial multiagent interaction, machine learning, ethical behavior, and explanation. The course is project-oriented where, over the course of the semester, small teams of students will design, implement, and evaluate autonomous agents operating in a real-world environment.",
                "prerequisites": [
                    "15281",
                    "10315",
                    "10301",
                    "10601",
                    "15381"
                ],
                "cp": [
                    2550,
                    1530
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "79",
            "ref": null,
            "props": {
                "keyFromParent": 79,
                "crs_id": "15494",
                "name": "Cognitive Robotics: The Future of Robot Toys",
                "description": "This course will explore the future of robot toys by analyzing and programming Anki Cozmo, a new robot with built-in artificial intelligence algorithms. Como is distinguished from earlier consumer robots by its reliance on vision as the primary sensing mode and its sophisticated use of A.I. Its capabilities include face and object recognition, map building, path planning, and object pushing and stacking. Although marketed as a pre-programmed childrens toy, Cozmos open source Python SDK allows anyone to develop new software for it, which means it can also be used for robotics education and research. The course will cover robot software architecture, human-robot interaction, perception, and planning algorithms for navigation and manipulation. Prior robotics experience is not required, just strong programming skills.",
                "prerequisites": [
                    "15122"
                ],
                "cp": [
                    450,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "86",
            "ref": null,
            "props": {
                "keyFromParent": 86,
                "crs_id": "15750",
                "name": "Graduate Algorithms",
                "description": "The course will cover a fairly wide range of topics in algorithm design. Some of the topics will be quite a bit older work from the 1960s to more recent work from this century. We hope to present as many different tools and algorithms as time permits. Most topics will be covered in two phases. In the first we will cover an important design technique by presenting a classic possibly simple application. In the second, an application will be presented that hopefully will be one that is new to most of the class. By the end of the class students are expected to be able to recognize which tool or method to apply to a problem and reasonably proficient at using this tool. We also feel that the student should be able to explain their algorithmic design idea to their peers and supervisors both in writing and orally. This is why we require both written and oral presentations of homework. Please check the preliminary schedule for an idea of the possible topics to be covered. The schedule at this point is mostly a list of topics covered some five years ago. The schedule will be updated with several newer topics. Please refer to https://www.cs.cmu.edu/csd-grad/courseschedules19.html for the most recent schedule updates.",
                "prerequisites": [],
                "cp": [
                    2550,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "177",
            "ref": null,
            "props": {
                "keyFromParent": 177,
                "crs_id": "15780",
                "name": "Graduate Artificial Intelligence",
                "description": "This course is targeted at graduate students who are interested in learning about artificial intelligence. The focus is on modern AI techniques. The course also covers techniques from the intersection of AI and other disciplines such as integer programming, continuous optimization, and game theory. The course content is profiled so as to not have too much overlap with narrower specialized AI courses offered at CMU. Please refer to http://www.cs.cmu.edu/csd-grad/courseschedules19.html for the most recent schedule updates.",
                "prerequisites": [],
                "cp": [
                    2550,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "172",
            "ref": null,
            "props": {
                "keyFromParent": 172,
                "crs_id": "15826",
                "name": "Multimedia Databases and Datamining",
                "description": "COURSES BEGIN THE WEEK OF SEPTEMBER 3rd. Please refer to https://www.cs.cmu.edu/csd-grad/courseschedulef19.html for the most recent schedule updates. DESCRIPTION The course covers advanced algorithms for learning, analysis, data management and visualization of large datasets. Topics include indexing for text and DNA databases, searching medical and multimedia databases by content, fundamental signal processing methods, compression, fractals in databases, data mining, privacy and security issues, rule discovery, data visualization, graph mining, stream mining.",
                "prerequisites": [],
                "cp": [
                    1050,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "167",
            "ref": null,
            "props": {
                "keyFromParent": 167,
                "crs_id": "15853",
                "name": "Algorithms in the Real World",
                "description": "COURSES BEGIN THE WEEK OF SEPTEMBER 3rd. Please refer to https://www.cs.cmu.edu/csd-grad/courseschedulef19.html for the most recent schedule updates.",
                "prerequisites": [],
                "cp": [
                    3450,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "6",
            "ref": null,
            "props": {
                "keyFromParent": 6,
                "crs_id": "16161",
                "name": "Freshman Seminar: Artificial Intelligence and Humanity",
                "description": "In 1965 British mathematician I.J. Good wrote, An ultraintelligent machine could design even better machines; there would then unquestionably be an intelligence explosion, and the intelligence of man would be left far behind. As we enter an age where companies like Uber are testing driverless cars in Pittsburgh and innovative interfaces like IBMs Watson can play jeopardy and learn techniques for medical diagnoses, how are we to negotiate an intelligence explosion that for many individuals might threaten the very notions of what it means to be human? The future of human-to-machine relationships will likely define our historical epoch and yet, many young technologists and humanists underestimate the downstream impact of technological innovations on human society. Presently, we have little choice but to attend to this rapidly anxiety-ridden question. This seminar will attend to the challenge of present existential questions on what it means to be human (read not machine) in the context of a rapidly advancing technological age. We will consider human narratives throughout history that exam how governments and individual citizens defined humanity in the context of slavery and colonialism as a framework for exploring and projecting what it means to be human in the age of rapidly advancing intelligent machines. We will trace the technological advancements of the recent five decades and identify historical precedents and speculative narratives that help us to consider issues like labor, economic disparity, negotiations of power, human dignity and ethical responsibility within the context of human relations with advancing technological tools that are now coined, artificial intelligence.",
                "prerequisites": [],
                "cp": [
                    1950,
                    90
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "78",
            "ref": null,
            "props": {
                "keyFromParent": 78,
                "crs_id": "16350",
                "name": "Planning Techniques for Robotics",
                "description": "Planning is one of the core components that enable robots to be autonomous. Robot planning is responsible for deciding in real-time what should the robot do next, how to do it, where should the robot move next and how to move there. This class does an in-depth study of popular planning techniques in robotics and examines their use in ground and aerial robots, humanoids, mobile manipulation platforms and multi-robot systems. The students learn the theory of these methods and also implement them in a series of programming-based projects. To take the class students should have taken an Intro to Robotics class and have a good knowledge of programming and data structures.",
                "prerequisites": [],
                "cp": [
                    150,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "92",
            "ref": null,
            "props": {
                "keyFromParent": 92,
                "crs_id": "16362",
                "name": "Mobile Robot Algorithms Laboratory",
                "description": "This course is a comprehensive hands-on introduction to the concepts and basic algorithms needed to make a mobile robot function reliably and effectively. We will work in small groups with small robots that are controlled over wireless from your laptop computers. The robots are custom-designed mini forktrucks that can move pallets from place to place just like commercial automated guided vehicles do today. The robots are programmed in the modern MATLAB programming environment. It is a pretty easy language to learn, and a very powerful one for prototyping robotics algorithms. You will get a lot of experience in this course in addition to some theory. Lectures are focused on the content of the next lab. There is a lab every week and they build on each other so that a complete robot software system results. The course will culminate with a class-wide robot competition that tests the performance of all of your code implemented in the semester. In order to succeed in the course, students must have a 1) 2nd year science/engineering level background in mathematics (matrices, vectors, coordinate systems) and 2) have already mastered at least one procedural programming language like C or Java, and 3) have enough experience to be reasonably prepared to write a 5000 line software system in 13 weeks with the help of one or two others. When the course is over, you will have written a single software system that has been incrementally extended in functionality and regularly debugged throughout the semester.",
                "prerequisites": [],
                "cp": [
                    450,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "114",
            "ref": null,
            "props": {
                "keyFromParent": 114,
                "crs_id": "16384",
                "name": "Robot Kinematics and Dynamics",
                "description": "Foundations and principles of robotic kinematics. Topics include transformations, forward kinematics, inverse kinematics, differential kinematics (Jacobians), manipulability, and basic equations of motion. Course also include programming on robot arms.",
                "prerequisites": [
                    "15122",
                    "18202",
                    "24311",
                    "21241",
                    "16311"
                ],
                "cp": [
                    3150,
                    1530
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "50",
            "ref": null,
            "props": {
                "keyFromParent": 50,
                "crs_id": "16385",
                "name": "Computer Vision:",
                "description": "This course provides a comprehensive introduction to computer vision. Major topics include image processing, detection and recognition, geometry-based and physics-based vision, sensing and perception, and video analysis. Students will learn basic concepts of computer vision as well as hands on experience to solve real-life vision problems. This course is for undergraduate students only.",
                "prerequisites": [
                    "18202",
                    "15122",
                    "21241",
                    "21259"
                ],
                "cp": [
                    3450,
                    630
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "52",
            "ref": null,
            "props": {
                "keyFromParent": 52,
                "crs_id": "16467",
                "name": "Human Robot Interaction",
                "description": "Human-robot interaction (HRI) is a multidisciplinary field that aims to create successful interactions between people and robots. HRI is rapidly becoming a major area of robotics research. Topics within HRI include the technology that enables robot systems to read and respond to humans, the science of interaction between people and robots, and the design of robot systems that operate in rewarding ways with people. HRI includes techniques from robotics, artificial intelligence, human factors, cognitive psychology, interaction design, human-computer interaction, and other fields. This course aims to provide an overview of the state of the art in HRI from these varied perspectives. To do so, it combines lectures with assignments (at-home readings, in-class presentations, and a final project) that engage students with the current challenges and approaches in the field. The course emphasizes the practice of reading and discussing scientific literature to learn and communicate about the most recent progress in HRI. It also includes guest lectures about emerging areas of research related to HRI.",
                "prerequisites": [],
                "cp": [
                    150,
                    810
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "192",
            "ref": null,
            "props": {
                "keyFromParent": 192,
                "crs_id": "17200",
                "name": "Ethics and Policy Issues in Computing",
                "description": "Note: Previously offered as 08-200. In this course, students will study the social impacts of computing technology and systems. The course will provide a brief introduction to ethics and to the new and difficult ethical questions modern computing technology presents us with. It will focus on a number of areas in which computers and information technology are having an impact on society including data privacy, social media, and autonomous technologies.",
                "prerequisites": [],
                "cp": [
                    3150,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "115",
            "ref": null,
            "props": {
                "keyFromParent": 115,
                "crs_id": "21120",
                "name": "Differential and Integral Calculus",
                "description": "Functions, limits, derivatives, logarithmic, exponential, and trigonometric functions, inverse functions; LHospitals Rule, curve sketching, Mean Value Theorem, related rates, linear and quadratic approximations, maximum-minimum problems, inverse functions, definite and indefinite integrals, and hyperbolic functions; applications of integration, integration by substitution and by parts. 3 hrs lec., 2 hrs. rec.",
                "prerequisites": [],
                "cp": [
                    3450,
                    1530
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "89",
            "ref": null,
            "props": {
                "keyFromParent": 89,
                "crs_id": "21122",
                "name": "Integration and Approximation",
                "description": "Integration by trigonometric substitution and partial fractions; arclength; improper integrals; Simpsons and Trapezoidal Rules for numerical integration; separable differential equations, Newtons method, Eulers method, Taylors Theorem including a discussion of the remainder, sequences, series, power series. Parametric curves, polar coordinates, vectors, dot product. 3 hrs lec., 2 hrs. rec.",
                "prerequisites": [
                    "21112",
                    "21120"
                ],
                "cp": [
                    3450,
                    1170
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "35",
            "ref": null,
            "props": {
                "keyFromParent": 35,
                "crs_id": "21241",
                "name": "Matrices and Linear Transformations",
                "description": "A first course in linear algebra intended for scientists, engineers, mathematicians and computer scientists. Students will be required to write some straightforward proofs. Topics to be covered: complex numbers, real and complex vectors and matrices, rowspace and columnspace of a matrix, rank and nullity, solving linear systems by row reduction of a matrix, inverse matrices and determinants, change of basis, linear transformations, inner product of vectors, orthonormal bases and the Gram-Schmidt process, eigenvectors and eigenvalues, diagonalization of a matrix, symmetric and orthogonal matrices. 21-127 is strongly recommended. 3 hrs. lec., 1 hr. rec",
                "prerequisites": [],
                "cp": [
                    2850,
                    450
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "99",
            "ref": null,
            "props": {
                "keyFromParent": 99,
                "crs_id": "36218",
                "name": "Probability Theory for Computer Scientists",
                "description": "Probability theory is the mathematical foundation for the study of both statistics and of random systems. This course is an intensive introduction to probability,from the foundations and mechanics to its application in statistical methods and modeling of random processes. Special topics and many examples are drawn from areas and problems that are of interest to computer scientists and that should prepare computer science students for the probabilistic and statistical ideas they encounter in downstream courses and research. A grade of C or better is required in order to use this course as a pre-requisite for 36-226, 36-326, and 36-410. Not open to students who have received credit for 36-225, 21-325, or 36-700. If you hold a Statistics primary/additional major or minor you will be required to complete 36-226. For those who do not have a major or minor in Statistics, and receive at least a B in 36-218, you will be eligible to move directly onto 36-401.",
                "prerequisites": [
                    "21112",
                    "21122",
                    "21259",
                    "21256",
                    "21123"
                ],
                "cp": [
                    2550,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "113",
            "ref": null,
            "props": {
                "keyFromParent": 113,
                "crs_id": "36401",
                "name": "Modern Regression",
                "description": "This course is an introduction to the real world of statistics and data analysis. We will explore real data sets, examine various models for the data, assess the validity of their assumptions, and determine which conclusions we can make (if any). Data analysis is a bit of an art; there may be several valid approaches. We will strongly emphasize the importance of critical thinking about the data and the question of interest. Our overall goal is to use a basic set of modeling tools to explore and analyze data and to present the results in a scientific report. A grade of C is required to move on to 36-402 or any 36-46x course.",
                "prerequisites": [
                    "36326",
                    "36625",
                    "36218",
                    "36226",
                    "21240",
                    "21241"
                ],
                "cp": [
                    2850,
                    1530
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "126",
            "ref": null,
            "props": {
                "keyFromParent": 126,
                "crs_id": "36402",
                "name": "Advanced Methods for Data Analysis",
                "description": "This course introduces modern methods of data analysis, building on the theory and application of linear models from 36-401. Topics include nonlinear regression, nonparametric smoothing, density estimation, generalized linear and generalized additive models, simulation and predictive model-checking, cross-validation, bootstrap uncertainty estimation, multivariate methods including factor analysis and mixture models, and graphical models and causal inference. Students will analyze real-world data from a range of fields, coding small programs and writing reports. Prerequisites: 36-401",
                "prerequisites": [
                    "36401"
                ],
                "cp": [
                    2850,
                    1710
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "188",
            "ref": null,
            "props": {
                "keyFromParent": 188,
                "crs_id": "36700",
                "name": "Probability and Mathematical Statistics",
                "description": "This is a one-semester course covering the basics of statistics. We will first provide a quick introduction to probability theory, and then cover fundamental topics in mathematical statistics such as point estimation, hypothesis testing, asymptotic theory, and Bayesian inference. If time permits, we will also cover more advanced and useful topics including nonparametric inference, regression and classification. Prerequisites: one- and two-variable calculus and matrix algebra.",
                "prerequisites": [],
                "cp": [
                    1950,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "174",
            "ref": null,
            "props": {
                "keyFromParent": 174,
                "crs_id": "36705",
                "name": "Intermediate Statistics",
                "description": "This course covers the fundamentals of theoretical statistics. Topics include: probability inequalities, point and interval estimation, minimax theory, hypothesis testing, data reduction, convergence concepts, Bayesian inference, nonparametric statistics, bootstrap resampling, VC dimension, prediction and model selection.",
                "prerequisites": [],
                "cp": [
                    1650,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "190",
            "ref": null,
            "props": {
                "keyFromParent": 190,
                "crs_id": "36707",
                "name": "Regression Analysis",
                "description": "This is a course in data analysis. Topics covered include: Simple and multiple linear regression, causation, weighted least-squares, global and case diagnostics, robust regression, exponential families, logistic regression and generalized linear models; Model selection: prediction risk, bias-variance tradeoff, risk estimation, model search, ridge regression and lasso, stepwise regression, maybe boosting; Smoothing and nonparametric regression: linear smoothers, kernels, local regression, penalized regression, regularization and splines, wavelets, variance estimation, confidence bands, local likelihood, additive models; Classification: parametric and nonparametric regression, LDA, QDA, trees. Practice in data analysis is obtained through course projects. This course is primarily for first year PhD students in Statistics Data Science; it requires an appropriate background for entering that program.",
                "prerequisites": [],
                "cp": [
                    2550,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "187",
            "ref": null,
            "props": {
                "keyFromParent": 187,
                "crs_id": "36709",
                "name": "Advanced Statistical Theory I",
                "description": "This is a core Ph.D. course in theoretical statistics. The class will cover a selection of modern topics in mathematical statistics, focussing on high-dimensional parametric models and non-parametric models. The main goal of the course is to provide the students with adequate theoretical background and mathematical tools to read and understand the current statistical literature on high-dimensional models. Topics will include: concentration inequalities, covariance estimation, principal component analysis, penalized linear regression, maximal inequalities for empirical processes, Rademacher and Gaussian complexities, non-parametric regression and minimax theory. This will be the first part of a two semester sequence.",
                "prerequisites": [
                    "36705"
                ],
                "cp": [
                    1650,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "186",
            "ref": null,
            "props": {
                "keyFromParent": "186",
                "crs_id": "36710",
                "name": "Advanced Statistical Theory II",
                "description": "This is a core Ph.D. course in theoretical statistics. The class will cover a selection of modern topics in mathematical statistics, focussing on high-dimensional parametric models and non-parametric models. The main goal of the course is to provide the students with adequate theoretical background and mathematical tools to read and understand the current statistical literature on high-dimensional models. Topics will include: concentration inequalities, covariance estimation, principal component analysis, penalized linear regression, maximal inequalities for empirical processes, Rademacher and Gaussian complexities, non-parametric regression and minimax theory.",
                "prerequisites": [],
                "cp": [
                    1350,
                    2610
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "170",
            "ref": null,
            "props": {
                "keyFromParent": 170,
                "crs_id": "76101",
                "name": "Interpretation and Argument",
                "description": "Interpretation and Argument is a foundational, inquiry-driven writing course that introduces students to a variety of strategies for making compositional decisions in writing and communication. Within the course, students learn genre-based skills applicable to a variety of different fields. Students use a comparative genre analysis method to learn how to use models to take on new writing tasks, including an academic research proposal and a research article that contributes to an ongoing academic conversation. Faculty who teach 76-101 typically select texts, ranging from scholarly texts, journalism, and film, about an issue so that students can identify interesting questions for their own research projects. Students should expect explicit, research-based instruction, practice, and reflection to build knowledge in controlling their writing processes and writing clear, well-supported, reader-oriented arguments. Because the course emphasizes the real stakes of communicating with readers and listeners, students share with their peers both low and high stakes written work within an interactive and collaborative classroom environment. Due to the limits of our schedule, we are unable to meet each students individual preferences for course topics, but we do offer a wide variety from which to choose. Section descriptions are posted at: http://www.cmu.edu/hss/english/first_year/index.html",
                "prerequisites": [],
                "cp": [
                    450,
                    2430
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "154",
            "ref": null,
            "props": {
                "keyFromParent": 154,
                "crs_id": "80249",
                "name": "AI, Society, and Humanity",
                "description": "AI and robotic technologies are rapidly developing and spreading, with corresponding social and human impacts opportunities. Understanding these potential risks and benefits requires a multidisciplinary approach, drawing from ethics, philosophy, psychology, sociology, economics, and more. These diverse perspectives can help us to ensure that new technologies support and advance human and social values interests. In this course, we will study relevant disciplinary methods frameworks through a series of case studies of current or near-future AI and robotic technologies. We will learn to apply those techniques to analyze and understand the challenges opportunities presented by novel technology.",
                "prerequisites": [],
                "cp": [
                    3450,
                    2070
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "131",
            "ref": null,
            "props": {
                "keyFromParent": 131,
                "crs_id": "85211",
                "name": "Cognitive Psychology",
                "description": "How do people perceive, learn, remember, and think? This course will consider perception, language, attention, learning, memory, reasoning, and decision making. Experimental findings and formal models will be discussed in each part of the course.",
                "prerequisites": [],
                "cp": [
                    450,
                    1890
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "121",
            "ref": null,
            "props": {
                "keyFromParent": 121,
                "crs_id": "85213",
                "name": "Human Information Processing and Artificial Intelligence",
                "description": "This class will review various results in cognitive psychology (attention, perception, memory, problem solving, language) and use of artificial intelligence techniques to simulate cognitive processes.",
                "prerequisites": [
                    "15122",
                    "15150"
                ],
                "cp": [
                    1350,
                    1710
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "103",
            "ref": null,
            "props": {
                "keyFromParent": 103,
                "crs_id": "85370",
                "name": "Perception",
                "description": "Perception, broadly defined, is the construction of a representation of the external world for purposes of thinking and acting. Although we often think of perception as the processing of inputs to the sense organs, the world conveyed by the senses is ambiguous, and cognitive and sensory systems interact to interpret it. In this course, we will examine the sensory-level mechanisms involved in perception by various sensory modalities, including vision, audition, and touch. We will learn how sensory coding interacts with top-down processing based on context and prior knowledge and how perception changes with learning and development. We will look at methods of psychophysics, neuroscience, and cognitive psychology. The goals include not only imparting basic knowledge about perception but also providing new insights into everyday experiences.",
                "prerequisites": [],
                "cp": [
                    3750,
                    1350
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "134",
            "ref": null,
            "props": {
                "keyFromParent": 134,
                "crs_id": "85390",
                "name": "Human Memory",
                "description": "Without memory, people would barely be able to function: we could not be able to communication because we would not be able to remember meanings or words, nor what anyone said to us; we could have no friends because everyone would be a stranger (no memory of meeting anyone); we could have no sense of self because we could not remember anything about ourselves either; we could not predict anything about the future because we would have no recollections of the past; we would not know how to get around, because we would have no knowledge of the environment. This course will discuss issues related to memory at all levels: the sensory registers, i.e., how we perceive things; working or short-term memory; long-term memory or our knowledge base. We will discuss the differences between procedural/skill knowledge, and declarative/fact knowledge. The topics of memory monitoring, feeling and knowing, spread of activation within memory (priming), implicit memory, and amnesia will also be covered.",
                "prerequisites": [
                    "85211",
                    "85213",
                    "85340"
                ],
                "cp": [
                    1350,
                    1890
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "157",
            "ref": null,
            "props": {
                "keyFromParent": 157,
                "crs_id": "85408",
                "name": "Visual Cognition",
                "description": "Recognizing an object, face or word is a complex process which is mastered with little effort by humans. This course adopts a three-pronged approach, drawing on psychological, neural and computational models to explore a range of topics including early vision, visual attention, face recognition, reading, object recognition, and visual imagery. The course will take a seminar format.",
                "prerequisites": [
                    "85211",
                    "85213",
                    "85219"
                ],
                "cp": [
                    450,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "158",
            "ref": null,
            "props": {
                "keyFromParent": 158,
                "crs_id": "85412",
                "name": "Cognitive Modeling:",
                "description": "This course will be concerned with modeling of agent behavior in a range of applications from laboratory experiments on human cognition, high-performance simulations such as flight simulators, and video game environments like Unreal Tournament. The first half of the course will teach a high-level modeling language for simulating human perception, cognition, and action. The second half of the course will be a project in which students develop a simulated agent or agents for the application of their choice.",
                "prerequisites": [
                    "15122",
                    "15150",
                    "15251",
                    "15210"
                ],
                "cp": [
                    750,
                    2250
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "13",
            "ref": null,
            "props": {
                "keyFromParent": 13,
                "crs_id": "85421",
                "name": "Language and Thought",
                "description": "The goal of this course is to provide students with the opportunity to creatively explore some difficult questions about the relationship between language and thought, questions such as: How does the human capacity to use language relate to the human capacity to think? Does the language that a person speaks affect the way she thinks? If meaning is in the head, how can we succeed in communicating with each other? How is our ability to reason related to our ability to successfully communicate? None of these questions have definite answers; throughout the course, we will draw on work in philosophy, psychology and linguistics to try to understand some of the possible answers that might be entertained. Students in the course should be prepared for extensive reading, writing and peer discussion assignments.",
                "prerequisites": [],
                "cp": [
                    150,
                    270
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        },
        {
            "key": "5",
            "ref": null,
            "props": {
                "keyFromParent": 5,
                "crs_id": "99101",
                "name": "Computing @ Carnegie Mellon",
                "description": "Computing@Carnegie Mellon (C@CM) is a 3-unit, pass/fail mini course that will help you develop foundational computing and information literacy skills, focusing on the tools and technologies that are specific to Carnegie Mellon so you can be successful in your other academic courses. All undergraduate students are required to take the course. C@CM is offered in a hybrid format through the Open Learning Initiatives (OLI) online course environment; meaning that youll complete your coursework online and attend a face-to-face recitation session for review and supplemental instruction.",
                "prerequisites": [],
                "cp": [
                    1650,
                    90
                ],
                "offset": 80,
                "display": "none"
            },
            "_owner": null
        }
    ],
    "map": {
        "0": "11492",
        "4": "15128",
        "5": "99101",
        "6": "16161",
        "13": "85421",
        "14": "11411",
        "18": "15151",
        "22": "15213",
        "26": "11442",
        "27": "11441",
        "35": "21241",
        "37": "15463",
        "45": "15122",
        "50": "16385",
        "52": "16467",
        "53": "05391",
        "67": "15150",
        "77": "15386",
        "78": "16350",
        "79": "15494",
        "85": "15259",
        "86": "15750",
        "87": "15281",
        "89": "21122",
        "90": "15387",
        "92": "16362",
        "93": "15210",
        "94": "15251",
        "96": "07180",
        "97": "10315",
        "99": "36218",
        "103": "85370",
        "112": "15482",
        "113": "36401",
        "114": "16384",
        "115": "21120",
        "121": "85213",
        "126": "36402",
        "131": "85211",
        "134": "85390",
        "135": "10745",
        "136": "10715",
        "139": "10718",
        "152": "10418",
        "154": "80249",
        "157": "85408",
        "158": "85412",
        "159": "10605",
        "160": "10708",
        "161": "10707",
        "165": "10703",
        "167": "15853",
        "170": "76101",
        "172": "15826",
        "174": "36705",
        "175": "10716",
        "176": "10403",
        "177": "15780",
        "178": "10417",
        "179": "11485",
        "186": "36710",
        "187": "36709",
        "188": "36700",
        "189": "05317",
        "190": "36707",
        "191": "10725",
        "192": "17200"
    }
}