{"view_size":[3900,2700],"cps":[[150,90],[450,90],[750,90],[1050,90],[1350,90],[1650,90],[1950,90],[2250,90],[2550,90],[2850,90],[3150,90],[3450,90],[3750,90],[150,270],[450,270],[750,270],[1050,270],[1350,270],[1650,270],[1950,270],[2250,270],[2550,270],[2850,270],[3150,270],[3450,270],[3750,270],[150,450],[450,450],[750,450],[1050,450],[1350,450],[1650,450],[1950,450],[2250,450],[2550,450],[2850,450],[3150,450],[3450,450],[3750,450],[150,630],[450,630],[750,630],[1050,630],[1350,630],[1650,630],[1950,630],[2250,630],[2550,630],[2850,630],[3150,630],[3450,630],[3750,630],[150,810],[450,810],[750,810],[1050,810],[1350,810],[1650,810],[1950,810],[2250,810],[2550,810],[2850,810],[3150,810],[3450,810],[3750,810],[150,990],[450,990],[750,990],[1050,990],[1350,990],[1650,990],[1950,990],[2250,990],[2550,990],[2850,990],[3150,990],[3450,990],[3750,990],[150,1170],[450,1170],[750,1170],[1050,1170],[1350,1170],[1650,1170],[1950,1170],[2250,1170],[2550,1170],[2850,1170],[3150,1170],[3450,1170],[3750,1170],[150,1350],[450,1350],[750,1350],[1050,1350],[1350,1350],[1650,1350],[1950,1350],[2250,1350],[2550,1350],[2850,1350],[3150,1350],[3450,1350],[3750,1350],[150,1530],[450,1530],[750,1530],[1050,1530],[1350,1530],[1650,1530],[1950,1530],[2250,1530],[2550,1530],[2850,1530],[3150,1530],[3450,1530],[3750,1530],[150,1710],[450,1710],[750,1710],[1050,1710],[1350,1710],[1650,1710],[1950,1710],[2250,1710],[2550,1710],[2850,1710],[3150,1710],[3450,1710],[3750,1710],[150,1890],[450,1890],[750,1890],[1050,1890],[1350,1890],[1650,1890],[1950,1890],[2250,1890],[2550,1890],[2850,1890],[3150,1890],[3450,1890],[3750,1890],[150,2070],[450,2070],[750,2070],[1050,2070],[1350,2070],[1650,2070],[1950,2070],[2250,2070],[2550,2070],[2850,2070],[3150,2070],[3450,2070],[3750,2070],[150,2250],[450,2250],[750,2250],[1050,2250],[1350,2250],[1650,2250],[1950,2250],[2250,2250],[2550,2250],[2850,2250],[3150,2250],[3450,2250],[3750,2250],[150,2430],[450,2430],[750,2430],[1050,2430],[1350,2430],[1650,2430],[1950,2430],[2250,2430],[2550,2430],[2850,2430],[3150,2430],[3450,2430],[3750,2430],[150,2610],[450,2610],[750,2610],[1050,2610],[1350,2610],[1650,2610],[1950,2610],[2250,2610],[2550,2610],[2850,2610],[3150,2610],[3450,2610],[3750,2610]],"crsList":[{"key":"5","ref":null,"props":{"keyFromParent":5,"crs_id":"COMS W1004","name":"Introduction To Computer Science And Programming In Java","description":"A general introduction to computer science for science and engineering students interested in majoring in computer science or engineering. Covers fundamental concepts of computer science, algorithmic problem-solving capabilities, and introductory Java programming skills. Assumes no prior programming background.","prerequisites":[],"cp":[1650,90],"offset":80,"display":"none"},"_owner":null},{"key":"44","ref":null,"props":{"keyFromParent":44,"crs_id":"COMS W3134","name":"Data Structures in Java","description":"Data types and structures: arrays, stacks, singly and doubly linked lists, queues, trees, sets, and graphs. Programming techniques for processing such structures: sorting and searching, hashing, garbage collection. Storage management. Rudiments of the analysis of algorithms. Taught in Java.","prerequisites":["COMS W1004"],"cp":[1650,630],"offset":80,"display":"none"},"_owner":null},{"key":"20","ref":null,"props":{"keyFromParent":"20","crs_id":"COMS W3157","name":"Advanced Programming","description":"Practical, hands-on introduction to programming techniques and tools for professional software construction, including learning how to write code to given specifications as well as document the results. Provides introductory overview of C and C++ in a UNIX environment, for students with Java background. Also introduces scripting languages (perl) and basic web programming. UNIX programming utilities are also covered. Lab required.","prerequisites":["COMS W1004"],"cp":[2250,270],"offset":80,"display":"none"},"_owner":null},{"key":"30","ref":null,"props":{"keyFromParent":30,"crs_id":"COMS W3203","name":"Discrete Mathematics: Introduction To Combinatorics and Graph Theory","description":"Logic and formal proofs, sequences and summation, mathematical induction, binomial coefficients, elements of finite probability, recurrence relations, equivalence relations and partial orderings, and topics in graph theory (including isomorphism, traversability, planarity, and colorings).","prerequisites":["COMS W1004"],"cp":[1350,450],"offset":80,"display":"none"},"_owner":null},{"key":"53","ref":null,"props":{"keyFromParent":53,"crs_id":"COMS W3261","name":"Computer Science Theory","description":"Regular languages: deterministic and non-deterministic finite automata, regular expressions. Context-free languages: context-free grammars, push-down automata. Turing machines, the Chomsky hierarchy, and the Church-Turing thesis. Introduction to Complexity Theory and NP-Completeness.","prerequisites":["COMS W3203","COMS W3134"],"cp":[450,810],"offset":80,"display":"none"},"_owner":null},{"key":"66","ref":null,"props":{"keyFromParent":66,"crs_id":"COMS W4111","name":"Introduction to Databases","description":"The fundamentals of database design and application development using databases: entity-relationship modeling, logical design of relational databases, relational data definition and manipulation languages, SQL, XML, query processing, physical database tuning, transaction processing, security. Programming projects are required.","prerequisites":["COMS W3134"],"cp":[450,990],"offset":80,"display":"none"},"_owner":null},{"key":"124","ref":null,"props":{"keyFromParent":124,"crs_id":"COMS W4160","name":"Computer Graphics","description":"Introduction to computer graphics. Topics include 3D viewing and projections, geometric modeling using spline curves, graphics systems such as OpenGL, lighting and shading, and global illumination. Significant implementation is required: the final project involves writing an interactive 3D video game in OpenGL.","prerequisites":["COMS W3134","MATH UN2010"],"cp":[2250,1710],"offset":80,"display":"none"},"_owner":null},{"key":"69","ref":null,"props":{"keyFromParent":69,"crs_id":"COMS W4701","name":"Artificial Intelligence","description":"Provides a broad understanding of the basic techniques for building intelligent computer systems. Topics include state-space problem representations, problem reduction and and-or graphs, game playing and heuristic search, predicate calculus, and resolution theorem proving, AI systems and languages for knowledge representation, machine learning and concept formation and other topics such as natural language processing may be included as time permits. Examples of AI applications where these techniques are used will be discussed.","prerequisites":["COMS W3134"],"cp":[1350,990],"offset":80,"display":"none"},"_owner":null},{"key":"122","ref":null,"props":{"keyFromParent":122,"crs_id":"COMS W4705","name":"Natural Language Processing","description":"Computational approaches to natural language generation and understanding. Recommended preparation: some previous or concurrent exposure to AI or Machine Learning. Topics include information extraction, summarization, machine translation, dialogue systems, and emotional speech. Particular attention is given to robust techniques that can handle understanding and generation for the large amounts of text on the Web or in other large corpora. Programming exercises in several of these areas.","prerequisites":["COMS W3134"],"cp":[1650,1710],"offset":80,"display":"none"},"_owner":null},{"key":"125","ref":null,"props":{"keyFromParent":125,"crs_id":"COMS W4731","name":"Computer Vision","description":"Introductory course in computer vision. Topics include image formation and optics, image sensing, binary images, image processing and filtering, edge extraction and boundary detection, region growing and segmentation, pattern classification methods, brightness and reflectance, shape from shading and photometric stereo, texture, binocular stereo, optical flow and motion, 2-D and 3-D object representation, object recognition, vision systems and applications.","prerequisites":["MATH UN2010","MATH UN1201","COMS W3157"],"cp":[2550,1710],"offset":80,"display":"none"},"_owner":null},{"key":"68","ref":null,"props":{"keyFromParent":68,"crs_id":"COMS W4733","name":"Computational Aspects of Robotics","description":"Introduction to robotics from a computer science perspective. Topics include coordinate frames and kinematics, computer architectures for robotics, integration and use of sensors, world modeling systems, design and use of robotic programming languages, and applications of artificial intelligence for planning, assembly, and manipulation.","prerequisites":["COMS W3134"],"cp":[1050,990],"offset":80,"display":"none"},"_owner":null},{"key":"95","ref":null,"props":{"keyFromParent":95,"crs_id":"COMS W4771","name":"Machine Learning","description":"Topics from generative and discriminative machine learning including least squares methods, support vector machines, kernel methods, neural networks, Gaussian distributions, linear classification, linear regression, maximum likelihood, exponential family distributions, Bayesian networks, Bayesian inference, mixture models, the EM algorithm, graphical models and hidden Markov models. Algorithms implemented in Matlab.","prerequisites":["COMS W4701","MATH UN2010","STAT GU4001"],"cp":[1350,1350],"offset":80,"display":"none"},"_owner":null},{"key":"120","ref":null,"props":{"keyFromParent":120,"crs_id":"COMS W6731","name":"Humanoid Robots","description":"Analysis of existing hardware and software platforms. Programming of multi-degree-of-freedom robots. Understanding sensor feedback in perceive-act-sense control paradigms. Task-level planning and reasoning. Final project includes implementing a humanoid robot task on either a simulated or physical robot.","prerequisites":["COMS W4701","COMS W4733"],"cp":[1050,1710],"offset":80,"display":"none"},"_owner":null},{"key":"40","ref":null,"props":{"keyFromParent":40,"crs_id":"CSEE W3827","name":"Fundamentals of Computer Systems","description":"Fundamentals of computer organization and digital logic. Boolean algebra, Karnaugh maps, basic gates and components, flipflops and latches, counters and state machines, basics of combinational and sequential digital design. Assembly language, instruction sets, ALU’s, single-cycle and multi-cycle processor design, introduction to pipelined processors, caches, and virtual memory.","prerequisites":["COMS W1004"],"cp":[450,630],"offset":80,"display":"none"},"_owner":null},{"key":"121","ref":null,"props":{"keyFromParent":121,"crs_id":"ECBM E6040","name":"Neural Networks and Deep Learning","description":"Regularized autoencoders, sparse coding and predictive sparse decomposition, denoising autoencoders, representation learning, manifold perspective on representation learning, structured probabilistic models for deep learning, Monte Carlo methods, training and evaluating models with intractable partition functions, restricted Boltzmann machines, approximate inference, deep belief networks, deep learning in speech and object recognition.","prerequisites":["COMS W4771"],"cp":[1350,1710],"offset":80,"display":"none"},"_owner":null},{"key":"126","ref":null,"props":{"keyFromParent":126,"crs_id":"EECS E6720","name":"Bayesian Models of Machine Learning","description":"This intermediate-level machine learning course will focus on Bayesian approaches to machine learning. Topics will include mixed-membership models, latent factor models and Bayesian nonparametric methods. We will also focus on mean-field variational Bayesian inference, an optimization-based approach to approximate posterior learning. Applications of these methods include image processing, topic modeling, collaborative filtering and recommendation systems. We will discuss a selection of these in class.","prerequisites":["COMS W4771","STAT GU4001"],"cp":[2850,1710],"offset":80,"display":"none"},"_owner":null},{"key":"139","ref":null,"props":{"keyFromParent":139,"crs_id":"EECS E6893","name":"Big Data Analytics","description":"This course shall provide the fundamental knowledge to equip students being able to handle those challenges. This discipline inherently invoves many fields. Because of its importance and broad impact, new software and hardware tools and algorithms are quickly emerging. A data scientist needs to keep up with this ever changing trends to be able to create a state-of-the-art solution for real-world challenges.","prerequisites":[],"cp":[2850,1890],"offset":80,"display":"none"},"_owner":null},{"key":"134","ref":null,"props":{"keyFromParent":134,"crs_id":"ELEN E4810","name":"Digital Signal Processing","description":"Digital filtering in time and frequency domain, including properties of discrete-time signals and systems, sampling theory, transform analysis, system structures, IIR and FIR filter design techniques, the discrete Fourier transform, fast Fourier transforms.","prerequisites":[],"cp":[1350,1890],"offset":80,"display":"none"},"_owner":null},{"key":"123","ref":null,"props":{"keyFromParent":123,"crs_id":"IEOR E8100\t","name":"Reinforcement Learning","description":"Beginning with foundations of sequential decision making and Markov Decision Processes, and quickly move on to the core challenges and recent approaches for largescale reinforcement learning. Through a combination of lectures, assignments, readings and project, the students will become well versed in the basic RL algorithmic techniques as well as deep RL based algorithmic techniques.","prerequisites":["STAT GU4001","COMS W4771"],"cp":[1950,1710],"offset":80,"display":"none"},"_owner":null},{"key":"22","ref":null,"props":{"keyFromParent":22,"crs_id":"MATH UN1101","name":"CALCULUS I","description":"Functions, limits, derivatives, introduction to integrals, or an understanding of pre-calculus will be assumed. , The Help Room in 333 Milbank Hall (Barnard College) is open during the day, Monday through Friday, to students seeking individual help from the teaching assistants. (SC)","prerequisites":[],"cp":[2850,270],"offset":80,"display":"none"},"_owner":null},{"key":"35","ref":null,"props":{"keyFromParent":35,"crs_id":"MATH UN1102","name":"CALCULUS II","description":"Methods of integration, applications of the integral, Taylor's theorem, infinite series. (SC)","prerequisites":["MATH UN1101"],"cp":[2850,450],"offset":80,"display":"none"},"_owner":null},{"key":"48","ref":null,"props":{"keyFromParent":48,"crs_id":"MATH UN1201","name":"CALCULUS III","description":"Vectors in dimensions 2 and 3, complex numbers and the complex exponential function with applications to differential equations, Cramer's rule, vector-valued functions of one variable, scalar-valued functions of several variables, partial derivatives, gradients, surfaces, optimization, the method of Lagrange multipliers. (SC)","prerequisites":["MATH UN1102"],"cp":[2850,630],"offset":80,"display":"none"},"_owner":null},{"key":"58","ref":null,"props":{"keyFromParent":58,"crs_id":"MATH UN2010","name":"LINEAR ALGEBRA","description":"Matrices, vector spaces, linear transformations, eigenvalues and eigenvectors, canonical forms, applications. (SC)","prerequisites":["MATH UN1201"],"cp":[1950,810],"offset":80,"display":"none"},"_owner":null},{"key":"135","ref":null,"props":{"keyFromParent":135,"crs_id":"PSYC GU5670","name":"Production and Perception of Language","description":"Topics include phonetic expression, motoric and perceptual organization, speech codes and memory codes, spoken word recognition, phrase formation, and the effects of context in perception and production.","prerequisites":[],"cp":[1650,1890],"offset":80,"display":"none"},"_owner":null},{"key":"72","ref":null,"props":{"keyFromParent":72,"crs_id":"STAT GU4001","name":"INTRODUCTION TO PROB & STAT","description":"A calculus-based tour of the fundamentals of probability theory and statistical inference. Probability models, random variables, useful distributions, conditioning, expectations, law of large numbers, central limit theorem, point and confidence interval estimation, hypothesis tests, linear regression.","prerequisites":["MATH UN1101","MATH UN1102"],"cp":[2250,990],"offset":80,"display":"none"},"_owner":null}],"map":{"5":"COMS W1004","20":"COMS W3157","22":"MATH UN1101","30":"COMS W3203","35":"MATH UN1102","40":"CSEE W3827","44":"COMS W3134","48":"MATH UN1201","53":"COMS W3261","58":"MATH UN2010","66":"COMS W4111","68":"COMS W4733","69":"COMS W4701","72":"STAT GU4001","95":"COMS W4771","120":"COMS W6731","121":"ECBM E6040","122":"COMS W4705","123":"IEOR E8100\t","124":"COMS W4160","125":"COMS W4731","126":"EECS E6720","134":"ELEN E4810","135":"PSYC GU5670","139":"EECS E6893"}}