{
    "view_size":[3000, 1800],
    "cps": [
        [
            150,
            90
        ],
        [
            450,
            90
        ],
        [
            750,
            90
        ],
        [
            1050,
            90
        ],
        [
            1350,
            90
        ],
        [
            1650,
            90
        ],
        [
            1950,
            90
        ],
        [
            2250,
            90
        ],
        [
            2550,
            90
        ],
        [
            2850,
            90
        ],
        [
            150,
            270
        ],
        [
            450,
            270
        ],
        [
            750,
            270
        ],
        [
            1050,
            270
        ],
        [
            1350,
            270
        ],
        [
            1650,
            270
        ],
        [
            1950,
            270
        ],
        [
            2250,
            270
        ],
        [
            2550,
            270
        ],
        [
            2850,
            270
        ],
        [
            150,
            450
        ],
        [
            450,
            450
        ],
        [
            750,
            450
        ],
        [
            1050,
            450
        ],
        [
            1350,
            450
        ],
        [
            1650,
            450
        ],
        [
            1950,
            450
        ],
        [
            2250,
            450
        ],
        [
            2550,
            450
        ],
        [
            2850,
            450
        ],
        [
            150,
            630
        ],
        [
            450,
            630
        ],
        [
            750,
            630
        ],
        [
            1050,
            630
        ],
        [
            1350,
            630
        ],
        [
            1650,
            630
        ],
        [
            1950,
            630
        ],
        [
            2250,
            630
        ],
        [
            2550,
            630
        ],
        [
            2850,
            630
        ],
        [
            150,
            810
        ],
        [
            450,
            810
        ],
        [
            750,
            810
        ],
        [
            1050,
            810
        ],
        [
            1350,
            810
        ],
        [
            1650,
            810
        ],
        [
            1950,
            810
        ],
        [
            2250,
            810
        ],
        [
            2550,
            810
        ],
        [
            2850,
            810
        ],
        [
            150,
            990
        ],
        [
            450,
            990
        ],
        [
            750,
            990
        ],
        [
            1050,
            990
        ],
        [
            1350,
            990
        ],
        [
            1650,
            990
        ],
        [
            1950,
            990
        ],
        [
            2250,
            990
        ],
        [
            2550,
            990
        ],
        [
            2850,
            990
        ],
        [
            150,
            1170
        ],
        [
            450,
            1170
        ],
        [
            750,
            1170
        ],
        [
            1050,
            1170
        ],
        [
            1350,
            1170
        ],
        [
            1650,
            1170
        ],
        [
            1950,
            1170
        ],
        [
            2250,
            1170
        ],
        [
            2550,
            1170
        ],
        [
            2850,
            1170
        ],
        [
            150,
            1350
        ],
        [
            450,
            1350
        ],
        [
            750,
            1350
        ],
        [
            1050,
            1350
        ],
        [
            1350,
            1350
        ],
        [
            1650,
            1350
        ],
        [
            1950,
            1350
        ],
        [
            2250,
            1350
        ],
        [
            2550,
            1350
        ],
        [
            2850,
            1350
        ],
        [
            150,
            1530
        ],
        [
            450,
            1530
        ],
        [
            750,
            1530
        ],
        [
            1050,
            1530
        ],
        [
            1350,
            1530
        ],
        [
            1650,
            1530
        ],
        [
            1950,
            1530
        ],
        [
            2250,
            1530
        ],
        [
            2550,
            1530
        ],
        [
            2850,
            1530
        ],
        [
            150,
            1710
        ],
        [
            450,
            1710
        ],
        [
            750,
            1710
        ],
        [
            1050,
            1710
        ],
        [
            1350,
            1710
        ],
        [
            1650,
            1710
        ],
        [
            1950,
            1710
        ],
        [
            2250,
            1710
        ],
        [
            2550,
            1710
        ],
        [
            2850,
            1710
        ]
    ],
    "crsList": [
        {
            "key": "90",
            "ref": null,
            "props": {
                "crs_id": "14.01",
                "name": "Principles of Microeconomics",
                "description": "Introduces microeconomic concepts and analysis, supply and demand analysis, theories of the firm and individual behavior, competition and monopoly, and welfare economics. Applications to problems of current economic policy. Taught in two formats - lecture/recitation and recitation only - each with 3 sessions per week. Same content and exams.",
                "prerequisites": [],
                "cp": [
                    150,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "91",
            "ref": null,
            "props": {
                "crs_id": "14.05",
                "name": "Intermediate Macroeconomics",
                "description": "Uses the tools of macroeconomics to investigate various macroeconomic issues in depth. Topics range from economic growth and inequality in the long run to economic stability and financial crises in the short run. Surveys many economic models used today. Requires a substantial research paper on the economics of long-run economic growth.",
                "prerequisites": [
                    "14.01"
                ],
                "cp": [
                    450,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "81",
            "ref": null,
            "props": {
                "crs_id": "14.12",
                "name": "Economic Applications of Game Theory",
                "description": "Analysis of strategic behavior in multi-person economic settings. Introduction to solution concepts, such as rationalizability, backwards induction, Nash equilibrium, subgame-perfect equilibrium, and sequential equilibrium, with a strong emphasis on the assumptions behind these solution concepts. Issues of incomplete information, such as signaling and reputation formation. Applications drawn from microeconomics and political economy.",
                "prerequisites": [
                    "14.01",
                    "6.041"
                ],
                "cp": [
                    450,
                    1530
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "80",
            "ref": null,
            "props": {
                "crs_id": "14.13",
                "name": "Psychology and Economics",
                "description": "Introduces the theoretical and empirical literature of behavioral economics. Examines important and systematic departures from the standard models in economics by incorporating insights from psychology and other social sciences. Covers theory and evidence on time, risk, and social preferences; beliefs and learning; emotions; limited attention; and frames, defaults, and nudges. Studies applications to many different areas, such as credit card debt, procrastination, retirement savings, addiction, portfolio choice, poverty, labor supply, happiness, and government policy. Students participate in surveys and experiments in class, review evidence from lab experiments, examine how the results can be integrated into models, and test models using field and lab data. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "14.01"
                ],
                "cp": [
                    150,
                    1530
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "92",
            "ref": null,
            "props": {
                "crs_id": "14.32",
                "name": "Econometric Data Science",
                "description": "Introduces multiple regression methods for causal inference and descriptive analysis in economics and related disciplines. Extensions include instrumental variables methods, analysis of randomized experiments and quasi-experimental research designs, and regression with time series data. Develops the skills needed to conduct - and critique - empirical studies in economics and related fields. Students complete an empirical project with a written description and interpretation of results; this may involve original data collection or use of existing data sets. Applications drawn from real-world examples and frontier research. Familiarity with statistical programming languages is helpful. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "14.30"
                ],
                "cp": [
                    750,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "71",
            "ref": null,
            "props": {
                "crs_id": "15.780",
                "name": "Stochastic Models in Business Analytics",
                "description": "Introduces core concepts in data-driven stochastic modeling that inform and optimize business decisions under uncertainty. Covers stochastic models and frameworks, such as queuing theory, time series forecasting, network models, dynamic programming, and stochastic optimization. Draws on real-world applications, with several examples from retail, healthcare, logistics, supply chain, social and online networks, and sports analytics.",
                "prerequisites": [
                    "6.041"
                ],
                "cp": [
                    450,
                    1350
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "6",
            "ref": null,
            "props": {
                "crs_id": "6.0001",
                "name": "Introduction to Computer Science Programming in Python",
                "description": "Introduction to computer science and programming for students with little or no programming experience. Students develop skills to program and use computational techniques to solve problems. Topics include the notion of computation, Python, simple algorithms and data structures, testing and debugging, and algorithmic complexity.  Combination of 6.0001 and 6.0002 counts as REST subject. Final given in the seventh week of the term.",
                "prerequisites": [],
                "cp": [
                    1950,
                    90
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "38",
            "ref": null,
            "props": {
                "crs_id": "6.003",
                "name": "Signals and Systems",
                "description": "Fundamentals of signal processing, focusing on the use of Fourier methods to analyze and process signals such as sounds and images. Topics include Fourier series, Fourier transforms, the Discrete Fourier Transform, sampling, convolution, deconvolution, filtering, noise reduction, and compression. Applications draw broadly from areas of contemporary interest with emphasis on both analysis and design.",
                "prerequisites": [
                    "6.0001",
                    "6.145",
                    "18.01"
                ],
                "cp": [
                    2550,
                    630
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "28",
            "ref": null,
            "props": {
                "crs_id": "6.004",
                "name": "Computation Structures",
                "description": "Provides an introduction to the design of digital systems and computer architecture. Emphasizes expressing all hardware designs in a high-level hardware language and synthesizing the designs. Topics include combinational and sequential circuits, instruction set abstraction for programmable hardware, single-cycle and pipelined processor implementations, multi-level memory hierarchies, virtual memory, exceptions and I/O, and parallel systems.",
                "prerequisites": [
                    "6.0001"
                ],
                "cp": [
                    2550,
                    450
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "15",
            "ref": null,
            "props": {
                "crs_id": "6.006",
                "name": "Introduction to Algorithms",
                "description": "Introduction to mathematical modeling of computational problems, as well as common algorithms, algorithmic paradigms, and data structures used to solve these problems. Emphasizes the relationship between algorithms and programming, and introduces basic performance measures and analysis techniques for these problems.",
                "prerequisites": [
                    "6.042",
                    "6.0001",
                    "6.009"
                ],
                "cp": [
                    1650,
                    270
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "18",
            "ref": null,
            "props": {
                "crs_id": "6.009",
                "name": "Fundamentals of Programming",
                "description": "Introduces fundamental concepts of programming. Designed to develop skills in applying basic methods from programming languages to abstract problems. Topics include programming and Python basics, computational concepts, software engineering, algorithmic techniques, data types, and recursion.  Lab component consists of software design, construction, and implementation of design.",
                "prerequisites": [
                    "6.0001",
                    "6.145"
                ],
                "cp": [
                    2550,
                    270
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "37",
            "ref": null,
            "props": {
                "crs_id": "6.01",
                "name": "Introduction to EECS via Robotics",
                "description": "An integrated introduction to electrical engineering and computer science, taught using substantial laboratory experiments with mobile robots. Key issues in the design of engineered artifacts operating in the natural world: measuring and modeling system behaviors; assessing errors in sensors and effectors; specifying tasks; designing solutions based on analytical and computational models; planning, executing, and evaluating experimental tests of performance; refining models and designs. Issues addressed in the context of computer programs, control systems, probabilistic inference problems, circuits and transducers, which all play important roles in achieving robust operation of a large variety of engineered systems.",
                "prerequisites": [
                    "6.0001",
                    "6.145"
                ],
                "cp": [
                    2250,
                    630
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "19",
            "ref": null,
            "props": {
                "crs_id": "6.031",
                "name": "Elements of Software Construction",
                "description": "Introduces fundamental principles and techniques of software development: how to write software that is safe from bugs, easy to understand, and ready for change. Topics include specifications and invariants; testing, test-case generation, and coverage; abstract data types and representation independence; design patterns for object-oriented programming; concurrent programming, including message passing and shared memory concurrency, and defending against races and deadlock; and functional programming with immutable data and higher-order functions. Includes weekly programming exercises and larger group programming projects.",
                "prerequisites": [
                    "6.009"
                ],
                "cp": [
                    2850,
                    270
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "29",
            "ref": null,
            "props": {
                "crs_id": "6.033",
                "name": "Computer Systems Engineering",
                "description": "Topics on the engineering of computer software and hardware systems: techniques for controlling complexity; strong modularity using client-server design, operating systems; performance, networks; naming; security and privacy; fault-tolerant systems, atomicity and coordination of concurrent activities, and recovery; impact of computer systems on society. Case studies of working systems and readings from the current literature provide comparisons and contrasts. Includes a single, semester-long design project. Students engage in extensive written communication exercises. Enrollment may be limited.",
                "prerequisites": [
                    "6.004",
                    "6.009"
                ],
                "cp": [
                    2850,
                    450
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "45",
            "ref": null,
            "props": {
                "crs_id": "6.034",
                "name": "Artificial Intelligence",
                "description": "Introduces representations, methods, and architectures used to build applications and to account for human intelligence from a computational point of view. Covers applications of rule chaining, constraint propagation, constrained search, inheritance, statistical inference, and other problem-solving paradigms. Also addresses applications of identification trees, neural nets, genetic algorithms, support-vector machines, boosting, and other learning paradigms. Considers what separates human intelligence from that of other animals. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "6.0001"
                ],
                "cp": [
                    1650,
                    810
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "36",
            "ref": null,
            "props": {
                "crs_id": "6.036",
                "name": "Introduction to Machine Learning",
                "description": "Introduces principles, algorithms, and applications of machine learning from the point of view of modeling and prediction; formulation of learning problems; representation, over-fitting, generalization; clustering, classification, probabilistic modeling; and methods such as support vector machines, hidden Markov models, and neural networks. Students taking graduate version complete additional assignments. Meets with 6.862 when offered concurrently. Recommended prerequisites: 6.006 and 18.06. Enrollment may be limited.",
                "prerequisites": [
                    "6.0001",
                    "6.01",
                    "18.02"
                ],
                "cp": [
                    1950,
                    630
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "95",
            "ref": null,
            "props": {
                "crs_id": "6.041",
                "name": "Introduction to Probability",
                "description": "An introduction to probability theory, the modeling and analysis of probabilistic systems, and elements of statistical inference. Probabilistic models, conditional probability. Discrete and continuous random variables. Expectation and conditional expectation, and further topics about random variables. Limit Theorems. Bayesian estimation and hypothesis testing. Elements of classical statistical inference. Bernoulli and Poisson processes. Markov chains. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "18.02"
                ],
                "cp": [
                    1650,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "2",
            "ref": null,
            "props": {
                "crs_id": "6.042",
                "name": "Mathematics for Computer Science",
                "description": "Elementary discrete mathematics for computer science and engineering. Emphasis on mathematical definitions and proofs as well as on applicable methods. Topics include formal logic notation, proof methods; induction, well-ordering; sets, relations; elementary graph theory; asymptotic notation and growth of functions; permutations and combinations, counting principles; discrete probability. Further selected topics include recursive definition and structural induction, state machines and invariants, integer congruences, recurrences, generating functions.",
                "prerequisites": [
                    "18.01"
                ],
                "cp": [
                    750,
                    90
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "4",
            "ref": null,
            "props": {
                "crs_id": "6.045",
                "name": "Automata, Computability, and Complexity",
                "description": "Mathematical introduction to questions concerning the definition of computation, and what problems can be solved by computers. Considers what problems can be efficiently solved by way of finite automata, circuits, Turing machines, and communication complexity. Provides complete, rigorous answers to the questions in some cases; others are major open problems. Builds skills in classifying computational problems in terms of their difficulty. Discusses other fundamental issues, including the Church-Turing Thesis, the P versus NP problem, and the power of randomness.",
                "prerequisites": [
                    "6.042"
                ],
                "cp": [
                    1350,
                    90
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "25",
            "ref": null,
            "props": {
                "crs_id": "6.046",
                "name": "Design and Analysis of Algorithms",
                "description": "Techniques for the design and analysis of efficient algorithms, emphasizing methods useful in practice. Topics include sorting; search trees, heaps, and hashing; divide-and-conquer; dynamic programming; greedy algorithms; amortized analysis; graph algorithms; and shortest paths. Advanced topics may include network flow; computational geometry; number-theoretic algorithms; polynomial and matrix calculations; caching; and parallel computing.",
                "prerequisites": [
                    "6.006"
                ],
                "cp": [
                    1650,
                    450
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "96",
            "ref": null,
            "props": {
                "crs_id": "6.207",
                "name": "Networks",
                "description": "See description under subject 14.15[J].",
                "prerequisites": [
                    "6.041",
                    "14.30"
                ],
                "cp": [
                    1950,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "34",
            "ref": null,
            "props": {
                "crs_id": "6.345",
                "name": "Automatic Speech Recognition",
                "description": "Introduces the rapidly developing fields of automatic speech recognition and spoken language processing. Topics include acoustic theory of speech production, acoustic-phonetics, signal representation, acoustic and language modeling, search, hidden Markov modeling, neural networks models, adaptation, and other related speech processing topics. Lecture material intersperses theory with practice. Includes problem sets, laboratory exercises, and opened-ended term project.",
                "prerequisites": [
                    "6.011",
                    "6.036"
                ],
                "cp": [
                    1350,
                    630
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "65",
            "ref": null,
            "props": {
                "crs_id": "6.437",
                "name": "Inference and Information",
                "description": "Introduction to principles of Bayesian and non-Bayesian statistical inference. Hypothesis testing and parameter estimation, sufficient statistics; exponential families. EM agorithm. Log-loss inference criterion, entropy and model capacity. Kullback-Leibler distance and information geometry. Asymptotic analysis and large deviations theory. Model order estimation; nonparametric statistics. Computational issues and approximation techniques; Monte Carlo methods. Selected topics such as universal inference and learning, and universal features and neural networks.",
                "prerequisites": [
                    "6.008",
                    "6.041",
                    "6.436"
                ],
                "cp": [
                    1650,
                    1170
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "64",
            "ref": null,
            "props": {
                "crs_id": "6.438",
                "name": "Algorithms for Inference",
                "description": "Introduction to statistical inference with probabilistic graphical models. Directed and undirected graphical models, and factor graphs, over discrete and Gaussian distributions; hidden Markov models, linear dynamical systems. Sum-product and junction tree algorithms; forward-backward algorithm, Kalman filtering and smoothing. Min-sum and Viterbi algorithms. Variational methods, mean-field theory, and loopy belief propagation. Particle methods and filtering. Building graphical models from data, including parameter estimation and structure learning; Baum-Welch and Chow-Liu algorithms. Selected special topics.",
                "prerequisites": [
                    "18.06",
                    "6.008",
                    "6.041",
                    "6.436"
                ],
                "cp": [
                    1350,
                    1170
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "39",
            "ref": null,
            "props": {
                "crs_id": "6.801",
                "name": "Machine Vision",
                "description": "Deriving a symbolic description of the environment from an image. Understanding physics of image formation. Image analysis as an inversion problem. Binary image processing and filtering of images as preprocessing steps. Recovering shape, lightness, orientation, and motion. Using constraints to reduce the ambiguity. Photometric stereo and extended Gaussian sphere. Applications to robotics; intelligent interaction of machines with their environment. Students taking the graduate version complete different assignments.",
                "prerequisites": [
                    "6.003"
                ],
                "cp": [
                    2850,
                    630
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "58",
            "ref": null,
            "props": {
                "crs_id": "6.802",
                "name": "Computational Systems Biology: Deep Learning in the Life Sciences",
                "description": "Presents innovative approaches to computational problems in the life sciences, focusing on deep learning-based approaches with comparisons to conventional methods. Topics include protein-DNA interaction, chromatin accessibility, regulatory variant interpretation, medical image understanding, medical record understanding, therapeutic design, and experiment design (the choice and interpretation of interventions). Focuses on machine learning model selection, robustness, and interpretation. Teams complete a multidisciplinary final research project using TensorFlow or other framework. Provides a comprehensive introduction to each life sciences problem, but relies upon students understanding probabilistic problem formulations. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "7.05",
                    "6.0002",
                    "6.01"
                ],
                "cp": [
                    2550,
                    990
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "55",
            "ref": null,
            "props": {
                "crs_id": "6.803",
                "name": "The Human Intelligence Enterprise",
                "description": "Analyzes seminal work directed at the development of a computational understanding of human intelligence, such as work on learning, language, vision, event representation, commonsense reasoning, self reflection, story understanding, and analogy. Reviews visionary ideas of Turing, Minsky, and other influential thinkers. Examines the implications of work on brain scanning, developmental psychology, and cognitive psychology. Emphasis on discussion and analysis of original papers. Students taking graduate version complete additional assignments. Enrollment limited.",
                "prerequisites": [
                    "6.034"
                ],
                "cp": [
                    1650,
                    990
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "68",
            "ref": null,
            "props": {
                "crs_id": "6.804",
                "name": "Computational Cognitive Science",
                "description": "See description under subject 9.66[J].",
                "prerequisites": [
                    "6.008",
                    "6.036",
                    "6.041",
                    "9.40",
                    "18.05"
                ],
                "cp": [
                    2550,
                    1170
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "24",
            "ref": null,
            "props": {
                "crs_id": "6.806",
                "name": "Advanced Natural Language Processing",
                "description": "Introduces the study of human language from a computational perspective, including syntactic, semantic and discourse processing models. Emphasizes machine learning methods and algorithms. Uses these methods and models in applications such as syntactic parsing, information extraction, statistical machine translation, dialogue systems, and summarization. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "6.046"
                ],
                "cp": [
                    1350,
                    450
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "53",
            "ref": null,
            "props": {
                "crs_id": "6.819",
                "name": "Advances in Computer Vision",
                "description": "Advanced topics in computer vision with a focus on the use of machine learning techniques and applications in graphics and human-computer interface. Covers image representations, texture models, structure-from-motion algorithms, Bayesian techniques, object and scene recognition, tracking, shape modeling, and image databases. Applications may include face recognition, multimodal interaction, interactive systems, cinematic special effects, and photorealistic rendering. Covers topics complementary to 6.801. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "18.06",
                    "6.041",
                    "6.042"
                ],
                "cp": [
                    1050,
                    990
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "44",
            "ref": null,
            "props": {
                "crs_id": "6.834",
                "name": "Cognitive Robotics",
                "description": "See description under subject 16.412[J]. Enrollment may be limited.",
                "prerequisites": [
                    "6.034",
                    "6.042",
                    "6.041"
                ],
                "cp": [
                    1350,
                    810
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "66",
            "ref": null,
            "props": {
                "crs_id": "6.860",
                "name": "Statistical Learning Theory and Applications",
                "description": "See description under subject 9.520[J].",
                "prerequisites": [
                    "6.041",
                    "6.867",
                    "18.06"
                ],
                "cp": [
                    1950,
                    1170
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "56",
            "ref": null,
            "props": {
                "crs_id": "6.863",
                "name": "Natural Language and the Computer Representation of Knowledge",
                "description": "Explores the relationship between the computer representation and acquisition of knowledge and the structure of human language, its acquisition, and hypotheses about its differentiating uniqueness. Emphasizes development of analytical skills necessary to judge the computational implications of grammatical formalisms and their role in connecting human intelligence to computational intelligence. Uses concrete examples to illustrate particular computational issues in this area.",
                "prerequisites": [
                    "6.034"
                ],
                "cp": [
                    1950,
                    990
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "48",
            "ref": null,
            "props": {
                "crs_id": "6.872",
                "name": "Biomedical Computing",
                "description": "Analyzes computational needs of clinical medicine, reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements to support precision medicine. Topics include the nature of clinical data, architecture and design of healthcare information systems, privacy and security issues, medical expert systems, predictive models and machine learning from big data in healthcare, and an introduction to bioinformatics. Case studies and guest lectures describe contemporary institutions, systems, and research projects. Term project using large clinical and genomic data sets integrates classroom topics.",
                "prerequisites": [
                    "6.034",
                    "6.036"
                ],
                "cp": [
                    2550,
                    810
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "99",
            "ref": null,
            "props": {
                "crs_id": "9.01",
                "name": "Introduction to Neuroscience",
                "description": "Introduction to the mammalian nervous system, with emphasis on the structure and function of the human brain. Topics include the function of nerve cells, sensory systems, control of movement, learning and memory, and diseases of the brain.",
                "prerequisites": [],
                "cp": [
                    2850,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "88",
            "ref": null,
            "props": {
                "crs_id": "9.19",
                "name": "Computational Psycholinguistics",
                "description": "Introduces computational approaches to natural language processing and acquisition by humans and machines, combining symbolic and probabilistic modeling techniques. Covers models such as n-grams, finite state automata, and context-free and mildly context-sensitive grammars, for analyzing phonology, morphology, syntax, semantics, pragmatics, and larger document structure. Applications range from accurate document classification and sentence parsing by machine to modeling human language acquisition and real-time understanding. Covers both theory and contemporary computational tools and datasets. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "6.0002",
                    "6.041",
                    "9.40"
                ],
                "cp": [
                    2550,
                    1530
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "59",
            "ref": null,
            "props": {
                "crs_id": "9.21",
                "name": "Cellular Neurophysiology and Computing",
                "description": "See description under subject 6.021[J]. Preference to juniors and seniors.",
                "prerequisites": [
                    "18.03",
                    "6.003"
                ],
                "cp": [
                    2850,
                    990
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "98",
            "ref": null,
            "props": {
                "crs_id": "9.35",
                "name": "Perception",
                "description": "Studies how the senses work and how physical stimuli are transformed into signals in the nervous system. Examines how the brain uses those signals to make inferences about the world, and uses illusions and demonstrations to gain insight into those inferences. Emphasizes audition and vision, with some discussion of touch, taste, and smell. Provides experience with psychophysical methods.",
                "prerequisites": [
                    "9.01"
                ],
                "cp": [
                    2550,
                    1710
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "89",
            "ref": null,
            "props": {
                "crs_id": "9.40",
                "name": "Introduction to Neural Computation",
                "description": "Introduces quantitative approaches to understanding brain and cognitive functions. Topics include mathematical description of neurons, the response of neurons to sensory stimuli, simple neuronal networks, statistical inference and decision making. Also covers foundational quantitative tools of data analysis in neuroscience: correlation, convolution, spectral analysis, principal components analysis. Mathematical concepts include simple differential equations and linear algebra.",
                "prerequisites": [
                    "6.0002",
                    "9.01"
                ],
                "cp": [
                    2850,
                    1530
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "69",
            "ref": null,
            "props": {
                "crs_id": "9.49",
                "name": "Neural Circuits for Cognition (New)",
                "description": "Takes a computational approach to examine circuits in the brain that perform elemental cognitive tasks: tasks that are neither directly sensory nor directly motor in function, but are essential to bridging from perception to action. Covers circuits and circuit motifs in the brain that underlie computations like integration, decision-making, spatial navigation, inference, and other cognitive elements. Students study empirical results, build dynamical models of neural circuits, and examine the mathematical theory of representations and computation in such circuits. Considers noise, stability, plasticity, and learning rules for these systems. Students taking graduate version complete additional assignments.",
                "prerequisites": [
                    "9.40",
                    "18.06"
                ],
                "cp": [
                    2850,
                    1170
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        },
        {
            "key": "78",
            "ref": null,
            "props": {
                "crs_id": "9.66",
                "name": "Computational Cognitive Science",
                "description": "Introduction to computational theories of human cognition. Focus on principles of inductive learning and inference, and the representation of knowledge. Computational frameworks covered include Bayesian and hierarchical Bayesian models; probabilistic graphical models; nonparametric statistical models and the Bayesian Occam's razor; sampling algorithms for approximate learning and inference; and probabilistic models defined over structured representations such as first-order logic, grammars, or relational schemas. Applications to understanding core aspects of cognition, such as concept learning and categorization, causal reasoning, theory formation, language acquisition, and social inference. Graduate students complete a final project.",
                "prerequisites": [
                    "6.008",
                    "6.036",
                    "6.041",
                    "9.40",
                    "18.05"
                ],
                "cp": [
                    2550,
                    1350
                ],
                "offset": 80
            },
            "_owner": null,
            "_store": {}
        }
    ],
    "map": {
        "2": "6.042",
        "4": "6.045",
        "6": "6.0001",
        "15": "6.006",
        "18": "6.009",
        "19": "6.031",
        "24": "6.806",
        "25": "6.046",
        "28": "6.004",
        "29": "6.033",
        "34": "6.345",
        "36": "6.036",
        "37": "6.01",
        "38": "6.003",
        "39": "6.801",
        "44": "6.834",
        "45": "6.034",
        "48": "6.872",
        "53": "6.819",
        "55": "6.803",
        "56": "6.863",
        "58": "6.802",
        "59": "9.21",
        "64": "6.438",
        "65": "6.437",
        "66": "6.860",
        "68": "6.804",
        "69": "9.49",
        "71": "15.780",
        "78": "9.66",
        "80": "14.13",
        "81": "14.12",
        "88": "9.19",
        "89": "9.40",
        "90": "14.01",
        "91": "14.05",
        "92": "14.32",
        "95": "6.041",
        "96": "6.207",
        "98": "9.35",
        "99": "9.01"
    }
}